SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/**
 *******************************************************************************
 * @file  HC32M120F6TB.h
 * @brief Headerfile for HC32M120F6TB series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-11-19       chengy          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2017, Huada Semiconductor Co.,Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file HC32M120F6TB.h
 **
 ** Auto generate.
 ** Headerfile for HC32M120F6TB series MCU
 **
 ** History:
 **
 **   - 2020-11-19  1.0   First version for Device Driver Library of HC32M120F6TB series MCU.
 **
 ******************************************************************************/

#ifndef __HC32M120F6TB_H__
#define __HC32M120F6TB_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M0+ Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             0       /*!< HC32M120F6TB provides an MPU                             */
#define __VTOR_PRESENT            1       /*!< HC32M120F6TB supported vector table registers            */
#define __NVIC_PRIO_BITS          2       /*!< HC32M120F6TB uses 2 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used         */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum IRQn
{
    NMI_IRQn            = -14, /*  2 Non Maskable                            */
    HardFault_IRQn      = -13, /*  3 Hard Fault                              */
    SVC_IRQn            = -5,  /* 11 SV Call                                 */
    PendSV_IRQn         = -2,  /* 14 Pend SV                                 */
    SysTick_IRQn        = -1,  /* 15 System Tick                             */
    EXINT00_IRQn        = 0,
    EXINT01_IRQn        = 1,
    EXINT02_IRQn        = 2,
    EXINT03_IRQn        = 3,
    EXINT04_IRQn        = 4,
    EXINT05_IRQn        = 5,
    EXINT06_IRQn        = 6,
    EXINT07_IRQn        = 7,
    Int008_IRQn         = 8,
    Int009_IRQn         = 9,
    Int010_IRQn         = 10,
    Int011_IRQn         = 11,
    Int012_IRQn         = 12,
    Int013_IRQn         = 13,
    Int014_IRQn         = 14,
    Int015_IRQn         = 15,
    Int016_IRQn         = 16,
    Int017_IRQn         = 17,
    Int018_IRQn         = 18,
    Int019_IRQn         = 19,
    Int020_IRQn         = 20,
    Int021_IRQn         = 21,
    Int022_IRQn         = 22,
    Int023_IRQn         = 23,
    Int024_IRQn         = 24,
    Int025_IRQn         = 25,
    Int026_IRQn         = 26,
    Int027_IRQn         = 27,
    Int028_IRQn         = 28,
    Int029_IRQn         = 29,
    Int030_IRQn         = 30,
    Int031_IRQn         = 31,

} IRQn_Type;

#include <core_cm0plus.h>
#include <stdint.h>

/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum en_event_src
{
    EVT_PORT_EIRQ0          = 0u,
    EVT_PORT_EIRQ8          = 1u,
    EVT_DMA_1_TC0           = 2u,
    EVT_DAM_1_BTC0          = 3u,
    EVT_PORT_EIRQ1          = 16u,
    EVT_PORT_EIRQ9          = 17u,
    EVT_DMA_2_TC0           = 18u,
    EVT_DAM_2_BTC0          = 19u,
    EVT_USART_1_RI          = 28u,
    EVT_PORT_EIRQ2          = 32u,
    EVT_TMR4_SCMUH          = 34u,
    EVT_TMR4_SCMUL          = 35u,
    EVT_TMR4_SCMVH          = 36u,
    EVT_TMR4_SCMVL          = 37u,
    EVT_TMR4_SCMWH          = 38u,
    EVT_TMR4_SCMWL          = 39u,
    EVT_USART_1_TI          = 44u,
    EVT_PORT_EIRQ3          = 48u,
    EVT_TMR0_GCMP           = 50u,
    EVT_AOS_STRG            = 59u,
    EVT_USART_3_RI          = 61u,
    EVT_SPI_SPRI            = 62u,
    EVT_PORT_EIRQ4          = 64u,
    EVT_TMRA_OVF            = 65u,
    EVT_TMRA_UDF            = 66u,
    EVT_TMRA_CMP            = 67u,
    EVT_TMRB_3_OVF          = 72u,
    EVT_TMRB_3_UDF          = 73u,
    EVT_TMRB_4_CMP          = 74u,
    EVT_ADC_EOCA            = 75u,
    EVT_USART_3_TI          = 77u,
    EVT_PORT_EIRQ5          = 80u,
    EVT_TMR2_GCMP           = 82u,
    EVT_TMRB_4_OVF          = 88u,
    EVT_TMRB_4_UDF          = 89u,
    EVT_TMRB_3_CMP          = 90u,
    EVT_ADC_EOCB            = 91u,
    EVT_USART_2_RI          = 92u,
    EVT_IIC_RXI             = 94u,
    EVT_PORT_EIRQ6          = 96u,
    EVT_CMP_1_IRQ           = 97u,
    EVT_EVENT_PORT          = 100u,
    EVT_TMRB_1_OVF          = 104u,
    EVT_TMRB_1_UDF          = 105u,
    EVT_TMRB_2_CMP          = 106u,
    EVT_ADC_CMP0            = 107u,
    EVT_USART_2_TI          = 108u,
    EVT_IIC_TXI             = 109u,
    EVT_PORT_EIRQ7          = 112u,
    EVT_CMP_2_IRQ           = 113u,
    EVT_FMC_OPTEND          = 116u,
    EVT_TMRB_2_OVF          = 120u,
    EVT_TMRB_2_UDF          = 121u,
    EVT_TMRB_1_CMP          = 122u,
    EVT_ADC_CMP1            = 123u,
    EVT_SPI_SPTI            = 125u,
} en_event_src_t;

/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum en_int_src
{
    INT_PORT_EIRQ0          = 0u,
    INT_PORT_EIRQ8          = 1u,
    INT_DAM_1_TC0           = 2u,
    INT_DAM_1_BTC0          = 3u,
    INT_EFM_PEERR           = 4u,
    INT_EFM_RDCOL           = 5u,
    INT_XTAL_STOP           = 6u,
    INT_SWDT_NMIUNDF        = 7u,
    INT_USART_1_EI          = 12u,
    INT_IIC_EEI             = 13u,
    INT_SPI_SPEI            = 14u,
    INT_PORT_EIRQ1          = 16u,
    INT_PORT_EIRQ9          = 17u,
    INT_DAM_2_TC0           = 18u,
    INT_DAM_2_BTC0          = 19u,
    INT_CTC_ERR             = 20u,
    INT_USART_1_RI          = 28u,
    INT_PORT_EIRQ2          = 32u,
    INT_DMA_ERR             = 33u,
    INT_TMR4_GCMUH          = 34u,
    INT_TMR4_GCMUL          = 35u,
    INT_TMR4_GCMVH          = 36u,
    INT_TMR4_GCMVL          = 37u,
    INT_TMR4_GCMWH          = 38u,
    INT_TMR4_GCMWL          = 39u,
    INT_USART_1_TI          = 44u,
    INT_USART_3_EI          = 45u,
    INT_PORT_EIRQ3          = 48u,
    INT_PORT_EKEY           = 49u,
    INT_TMR0_GCMP           = 50u,
    INT_TMR4_RLOU           = 52u,
    INT_TMR4_RLOV           = 53u,
    INT_TMR4_RLOW           = 54u,
    INT_EMB_GR              = 55u,
    INT_USART_1_TCI         = 60u,
    INT_USART_3_RI          = 61u,
    INT_SPI_SPRI            = 62u,
    INT_PORT_EIRQ4          = 64u,
    INT_TMRA_OVF            = 65u,
    INT_TMRA_UDF            = 66u,
    INT_TMRA_CMP            = 67u,
    INT_TMR4_GOVF           = 68u,
    INT_TMR4_GUDF           = 69u,
    INT_TMRB_3_OVF          = 72u,
    INT_TMRB_3_UDF          = 73u,
    INT_TMRB_4_CMP          = 74u,
    INT_ADC_EOCA            = 75u,
    INT_USART_2_EI          = 76u,
    INT_USART_3_TI          = 77u,
    INT_IIC_TEI             = 78u,
    INT_SPI_SPII            = 79u,
    INT_PORT_EIRQ5          = 80u,
    INT_TMR2_GCMP           = 82u,
    INT_TMR2_GOVF           = 83u,
    INT_TMRB_4_OVF          = 88u,
    INT_TMRB_4_UDF          = 89u,
    INT_TMRB_3_CMP          = 90u,
    INT_ADC_EOCB            = 91u,
    INT_USART_2_RI          = 92u,
    INT_USART_3_TCI         = 93u,
    INT_IIC_RXI             = 94u,
    INT_PORT_EIRQ6          = 96u,
    INT_CMP_1_IRQ           = 97u,
    INT_EVENT_PORT          = 100u,
    INT_TMRB_1_OVF          = 104u,
    INT_TMRB_1_UDF          = 105u,
    INT_TMRB_2_CMP          = 106u,
    INT_ADC_CMP0            = 107u,
    INT_USART_2_TI          = 108u,
    INT_IIC_TXI             = 109u,
    INT_PORT_EIRQ7          = 112u,
    INT_CMP_2_IRQ           = 113u,
    INT_PVD_DET             = 114u,
    INT_FMC_OPTEND          = 116u,
    INT_TMRB_2_OVF          = 120u,
    INT_TMRB_2_UDF          = 121u,
    INT_TMRB_1_CMP          = 122u,
    INT_ADC_CMP1            = 123u,
    INT_USART_2_TCI         = 124u,
    INT_SPI_SPTI            = 125u,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

typedef struct
{
    __IO uint8_t STRT                       : 1;
    uint8_t RESERVED1                       : 7;
} stc_adc_str_field_t;

typedef struct
{
    __IO uint16_t MS                        : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t ACCSEL                    : 2;
    __IO uint16_t CLREN                     : 1;
    __IO uint16_t DFMT                      : 1;
    uint16_t RESERVED8                      : 8;
} stc_adc_cr0_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 2;
    __IO uint16_t RSCHSEL                   : 1;
    uint16_t RESERVED3                      :13;
} stc_adc_cr1_field_t;

typedef struct
{
    __IO uint16_t TRGSELA                   : 2;
    uint16_t RESERVED2                      : 5;
    __IO uint16_t TRGENA                    : 1;
    __IO uint16_t TRGSELB                   : 2;
    uint16_t RESERVED10                     : 5;
    __IO uint16_t TRGENB                    : 1;
} stc_adc_trgsr_field_t;

typedef struct
{
    __IO uint16_t CHSELA                    : 8;
    uint16_t RESERVED8                      : 8;
} stc_adc_chselra0_field_t;

typedef struct
{
    __IO uint16_t CHSELB                    : 8;
    uint16_t RESERVED8                      : 8;
} stc_adc_chselrb0_field_t;

typedef struct
{
    __IO uint8_t EXCHSEL                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_adc_exchselr_field_t;

typedef struct
{
    __IO uint8_t EOCAF                      : 1;
    __IO uint8_t EOCBF                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_isr_field_t;

typedef struct
{
    __IO uint8_t EOCAIEN                    : 1;
    __IO uint8_t EOCBIEN                    : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_icr_field_t;

typedef struct
{
    __IO uint8_t CLREOCAF                   : 1;
    __IO uint8_t CLREOCBF                   : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_isclrr_field_t;

typedef struct
{
    __IO uint16_t AWD0EN                    : 1;
    __IO uint16_t AWD0IEN                   : 1;
    __IO uint16_t AWD0MD                    : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t AWD1EN                    : 1;
    __IO uint16_t AWD1IEN                   : 1;
    __IO uint16_t AWD1MD                    : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t AWDCM                     : 2;
    uint16_t RESERVED10                     : 6;
} stc_adc_awdcr_field_t;

typedef struct
{
    __IO uint8_t AWD0F                      : 1;
    __IO uint8_t AWD1F                      : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t AWDCMF                     : 1;
    uint8_t RESERVED5                       : 3;
} stc_adc_awdsr_field_t;

typedef struct
{
    __IO uint8_t CLRAWD0F                   : 1;
    __IO uint8_t CLRAWD1F                   : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t CLRAWDCMF                  : 1;
    uint8_t RESERVED5                       : 3;
} stc_adc_awdsclrr_field_t;

typedef struct
{
    __IO uint8_t AWDCH                      : 5;
    uint8_t RESERVED5                       : 3;
} stc_adc_awd0chsr_field_t;

typedef struct
{
    __IO uint8_t AWDCH                      : 5;
    uint8_t RESERVED5                       : 3;
} stc_adc_awd1chsr_field_t;

typedef struct
{
    __IO uint16_t OPA1EN                    : 1;
    __IO uint16_t OPA2EN                    : 1;
    uint16_t RESERVED2                      :14;
} stc_adc_opacr_field_t;

typedef struct
{
    __IO uint32_t STRG                      : 1;
    uint32_t RESERVED1                      :31;
} stc_aos_intc_strgcr_field_t;

typedef struct
{
    __IO uint32_t EVP1FEE                   : 1;
    __IO uint32_t EVP2FEE                   : 1;
    __IO uint32_t EVP3FEE                   : 1;
    __IO uint32_t EVP4FEE                   : 1;
    __IO uint32_t EVP1REE                   : 1;
    __IO uint32_t EVP2REE                   : 1;
    __IO uint32_t EVP3REE                   : 1;
    __IO uint32_t EVP4REE                   : 1;
    __IO uint32_t EVPDIVS                   : 2;
    __IO uint32_t EVPNFE                    : 1;
    uint32_t RESERVED11                     :21;
} stc_aos_evprt_cr_field_t;

typedef struct
{
    __IO uint32_t PTSTS0                    : 4;
    __IO uint32_t PTSTS1                    : 4;
    __IO uint32_t PTSTS2                    : 4;
    __IO uint32_t PTSTS3                    : 4;
    uint32_t RESERVED16                     :16;
} stc_aos_evprt_sr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_tmr0_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_tmr2_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_tmra_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_tmrb_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_adc_itrgselr0_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_adc_itrgselr1_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_dma0_trgsel_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_dma1_trgsel_field_t;

typedef struct
{
    __IO uint8_t CENB                       : 1;
    __IO uint8_t CWDE                       : 1;
    uint8_t RESERVED2                       : 5;
    __IO uint8_t CMON                       : 1;
} stc_cmp_mdr_field_t;

typedef struct
{
    __IO uint8_t FCKS                       : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EDGS                       : 2;
    __IO uint8_t CIEN                       : 1;
    uint8_t RESERVED7                       : 1;
} stc_cmp_fir_field_t;

typedef struct
{
    __IO uint8_t COEN                       : 1;
    __IO uint8_t COPS                       : 1;
    __IO uint8_t CPOE                       : 1;
    __IO uint8_t TWOE                       : 1;
    __IO uint8_t TWOL                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_cmp_ocr_field_t;

typedef struct
{
    __IO uint8_t RVSL                       : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t CVSL                       : 3;
    uint8_t RESERVED7                       : 1;
} stc_cmp_vsr_field_t;

typedef struct
{
    __IO uint8_t CTWS0                      : 1;
    __IO uint8_t CTWS1                      : 1;
    __IO uint8_t CTWS2                      : 1;
    __IO uint8_t CTWS3                      : 1;
    __IO uint8_t CTWS4                      : 1;
    __IO uint8_t CTWS5                      : 1;
    __IO uint8_t CTWS6                      : 1;
    __IO uint8_t CTWS7                      : 1;
} stc_cmp_twr1_field_t;

typedef struct
{
    __IO uint8_t CTWP0                      : 1;
    __IO uint8_t CTWP1                      : 1;
    __IO uint8_t CTWP2                      : 1;
    __IO uint8_t CTWP3                      : 1;
    __IO uint8_t CTWP4                      : 1;
    __IO uint8_t CTWP5                      : 1;
    __IO uint8_t CTWP6                      : 1;
    __IO uint8_t CTWP7                      : 1;
} stc_cmp_twr2_field_t;

typedef struct
{
    __IO uint8_t PERICKSEL                  : 3;
    uint8_t RESERVED3                       : 5;
} stc_cmu_pericksel_field_t;

typedef struct
{
    __IO uint8_t XTALSTDF                   : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_xtalstdsr_field_t;

typedef struct
{
    __IO uint8_t SCKDIV                     : 3;
    uint8_t RESERVED3                       : 5;
} stc_cmu_sckdivr_field_t;

typedef struct
{
    __IO uint8_t CKSW                       : 2;
    uint8_t RESERVED2                       : 6;
} stc_cmu_ckswr_field_t;

typedef struct
{
    __IO uint8_t XTALSTP                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_xtalcr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t XTALDRV                    : 2;
    __IO uint8_t XTALMS                     : 1;
    __IO uint8_t SUPDRV                     : 1;
} stc_cmu_xtalcfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTB                    : 3;
    uint8_t RESERVED3                       : 5;
} stc_cmu_xtalstbcr_field_t;

typedef struct
{
    __IO uint8_t HRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_hrccr_field_t;

typedef struct
{
    __IO uint8_t HRCSTBF                    : 1;
    uint8_t RESERVED1                       : 2;
    __IO uint8_t XTALSTBF                   : 1;
    uint8_t RESERVED4                       : 4;
} stc_cmu_oscstbsr_field_t;

typedef struct
{
    __IO uint8_t MCO1SEL                    : 4;
    __IO uint8_t MCO1DIV                    : 3;
    __IO uint8_t MCO1EN                     : 1;
} stc_cmu_mco1cfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDIE                  : 1;
    __IO uint8_t XTALSTDRE                  : 1;
    __IO uint8_t XTALSTDRIS                 : 1;
    uint8_t RESERVED3                       : 4;
    __IO uint8_t XTALSTDE                   : 1;
} stc_cmu_xtalstdcr_field_t;

typedef struct
{
    __IO uint32_t ADC                       : 1;
    __IO uint32_t CTC                       : 1;
    __IO uint32_t CMP                       : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t AOS                       : 1;
    __IO uint32_t DMA                       : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t CRC                       : 1;
    __IO uint32_t TIMB1                     : 1;
    __IO uint32_t TIMB2                     : 1;
    __IO uint32_t TIMB3                     : 1;
    __IO uint32_t TIMB4                     : 1;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t TIM0                      : 1;
    __IO uint32_t TIM2                      : 1;
    __IO uint32_t TIM4                      : 1;
    __IO uint32_t TIMA                      : 1;
    __IO uint32_t EMB                       : 1;
    uint32_t RESERVED21                     : 3;
    __IO uint32_t UART1                     : 1;
    __IO uint32_t UART2                     : 1;
    __IO uint32_t UART3                     : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t IIC                       : 1;
    __IO uint32_t SPI                       : 1;
    uint32_t RESERVED30                     : 2;
} stc_cmu_fcg_field_t;

typedef struct
{
    __IO uint8_t LRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_lrccr_field_t;

typedef struct
{
    __IO uint32_t CR                        : 1;
    __IO uint32_t FLAG                      : 1;
    uint32_t RESERVED2                      :30;
} stc_crc_cr_field_t;

typedef struct
{
    __IO uint32_t REFPSC                    : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t REFCKS                    : 2;
    __IO uint32_t ERRIE                     : 1;
    __IO uint32_t CTCEN                     : 1;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t TRMVAL                    : 6;
    uint32_t RESERVED22                     :10;
} stc_ctc_cr1_field_t;

typedef struct
{
    __IO uint32_t OFSVAL                    : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t RLDVAL                    :16;
} stc_ctc_cr2_field_t;

typedef struct
{
    __IO uint32_t TRIMOK                    : 1;
    __IO uint32_t TRMOVF                    : 1;
    __IO uint32_t TRMUDF                    : 1;
    __IO uint32_t CTCBSY                    : 1;
    uint32_t RESERVED4                      :28;
} stc_ctc_str_field_t;

typedef struct
{
    __IO uint32_t CDBGPWRUPREQ              : 1;
    __IO uint32_t CDBGPWRUPACK              : 1;
    uint32_t RESERVED2                      :30;
} stc_dbgc_mcudbgstat_field_t;

