SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
#define M0P_ADC                              ((M0P_ADC_TypeDef *)0x4000B800UL)
#define M0P_AOS                              ((M0P_AOS_TypeDef *)0x40000C00UL)
#define M0P_CMP1                             ((M0P_CMP_TypeDef *)0x4000C800UL)
#define M0P_CMP2                             ((M0P_CMP_TypeDef *)0x4000C810UL)
#define M0P_CMU                              ((M0P_CMU_TypeDef *)0x40014400UL)
#define M0P_CRC                              ((M0P_CRC_TypeDef *)0x40015400UL)
#define M0P_CTC                              ((M0P_CTC_TypeDef *)0x40000000UL)
#define M0P_DBGC                             ((M0P_DBGC_TypeDef *)0x40015000UL)
#define M0P_DBGC_T                           ((M0P_DBGC_T_TypeDef *)0xE0042000UL)
#define M0P_DMA                              ((M0P_DMA_TypeDef *)0x40013000UL)
#define M0P_EFM                              ((M0P_EFM_TypeDef *)0x40000800UL)
#define M0P_EMB                              ((M0P_EMB_TypeDef *)0x40006C00UL)
#define M0P_I2C                              ((M0P_I2C_TypeDef *)0x40004800UL)
#define M0P_ICG                              ((M0P_ICG_TypeDef *)0x000000C0UL)
#define M0P_INTC                             ((M0P_INTC_TypeDef *)0x40011000UL)
#define M0P_PORT                             ((M0P_PORT_TypeDef *)0x40013800UL)
#define M0P_PWC                              ((M0P_PWC_TypeDef *)0x40014000UL)
#define M0P_RMU                              ((M0P_RMU_TypeDef *)0x40014100UL)
#define M0P_SPI                              ((M0P_SPI_TypeDef *)0x40003800UL)
#define M0P_SWDT                             ((M0P_SWDT_TypeDef *)0x4000CC00UL)
#define M0P_TMR0                             ((M0P_TMR0_TypeDef *)0x40005800UL)
#define M0P_TMR2                             ((M0P_TMR2_TypeDef *)0x40006000UL)
#define M0P_TMR4                             ((M0P_TMR4_TypeDef *)0x40006800UL)
#define M0P_TMRA                             ((M0P_TMRA_TypeDef *)0x40007000UL)
#define M0P_TMRB1                            ((M0P_TMRB_TypeDef *)0x40007800UL)
#define M0P_TMRB2                            ((M0P_TMRB_TypeDef *)0x40007C00UL)
#define M0P_TMRB3                            ((M0P_TMRB_TypeDef *)0x40008000UL)
#define M0P_TMRB4                            ((M0P_TMRB_TypeDef *)0x40008400UL)
#define M0P_USART1                           ((M0P_USART_TypeDef *)0x40001800UL)
#define M0P_USART2                           ((M0P_USART_TypeDef *)0x40001C00UL)
#define M0P_USART3                           ((M0P_USART_TypeDef *)0x40002000UL)


/******************************************************************************/
/*                   Peripheral Registers Bits Definition                     */
/******************************************************************************/

/*******************************************************************************
                Bit definition for Peripheral ADC
*******************************************************************************/
/*  Bit definition for ADC_STR register  */
#define ADC_STR_STRT_POS                     (0U)
#define ADC_STR_STRT                         ((uint8_t)0x01U)

/*  Bit definition for ADC_CR0 register  */
#define ADC_CR0_MS_POS                       (0U)
#define ADC_CR0_MS                           ((uint16_t)0x0003U)
#define ADC_CR0_MS_0                         ((uint16_t)0x0001U)
#define ADC_CR0_MS_1                         ((uint16_t)0x0002U)
#define ADC_CR0_ACCSEL_POS                   (4U)
#define ADC_CR0_ACCSEL                       ((uint16_t)0x0030U)
#define ADC_CR0_ACCSEL_0                     ((uint16_t)0x0010U)
#define ADC_CR0_ACCSEL_1                     ((uint16_t)0x0020U)
#define ADC_CR0_CLREN_POS                    (6U)
#define ADC_CR0_CLREN                        ((uint16_t)0x0040U)
#define ADC_CR0_DFMT_POS                     (7U)
#define ADC_CR0_DFMT                         ((uint16_t)0x0080U)

/*  Bit definition for ADC_CR1 register  */
#define ADC_CR1_RSCHSEL_POS                  (2U)
#define ADC_CR1_RSCHSEL                      ((uint16_t)0x0004U)

/*  Bit definition for ADC_TRGSR register  */
#define ADC_TRGSR_TRGSELA_POS                (0U)
#define ADC_TRGSR_TRGSELA                    ((uint16_t)0x0003U)
#define ADC_TRGSR_TRGSELA_0                  ((uint16_t)0x0001U)
#define ADC_TRGSR_TRGSELA_1                  ((uint16_t)0x0002U)
#define ADC_TRGSR_TRGENA_POS                 (7U)
#define ADC_TRGSR_TRGENA                     ((uint16_t)0x0080U)
#define ADC_TRGSR_TRGSELB_POS                (8U)
#define ADC_TRGSR_TRGSELB                    ((uint16_t)0x0300U)
#define ADC_TRGSR_TRGSELB_0                  ((uint16_t)0x0100U)
#define ADC_TRGSR_TRGSELB_1                  ((uint16_t)0x0200U)
#define ADC_TRGSR_TRGENB_POS                 (15U)
#define ADC_TRGSR_TRGENB                     ((uint16_t)0x8000U)

/*  Bit definition for ADC_CHSELRA0 register  */
#define ADC_CHSELRA0_CHSELA_POS              (0U)
#define ADC_CHSELRA0_CHSELA                  ((uint16_t)0x00FFU)
#define ADC_CHSELRA0_CHSELA_0                ((uint16_t)0x0001U)
#define ADC_CHSELRA0_CHSELA_1                ((uint16_t)0x0002U)
#define ADC_CHSELRA0_CHSELA_2                ((uint16_t)0x0004U)
#define ADC_CHSELRA0_CHSELA_3                ((uint16_t)0x0008U)
#define ADC_CHSELRA0_CHSELA_4                ((uint16_t)0x0010U)
#define ADC_CHSELRA0_CHSELA_5                ((uint16_t)0x0020U)
#define ADC_CHSELRA0_CHSELA_6                ((uint16_t)0x0040U)
#define ADC_CHSELRA0_CHSELA_7                ((uint16_t)0x0080U)

/*  Bit definition for ADC_CHSELRB0 register  */
#define ADC_CHSELRB0_CHSELB_POS              (0U)
#define ADC_CHSELRB0_CHSELB                  ((uint16_t)0x00FFU)
#define ADC_CHSELRB0_CHSELB_0                ((uint16_t)0x0001U)
#define ADC_CHSELRB0_CHSELB_1                ((uint16_t)0x0002U)
#define ADC_CHSELRB0_CHSELB_2                ((uint16_t)0x0004U)
#define ADC_CHSELRB0_CHSELB_3                ((uint16_t)0x0008U)
#define ADC_CHSELRB0_CHSELB_4                ((uint16_t)0x0010U)
#define ADC_CHSELRB0_CHSELB_5                ((uint16_t)0x0020U)
#define ADC_CHSELRB0_CHSELB_6                ((uint16_t)0x0040U)
#define ADC_CHSELRB0_CHSELB_7                ((uint16_t)0x0080U)

/*  Bit definition for ADC_EXCHSELR register  */
#define ADC_EXCHSELR_EXCHSEL_POS             (0U)
#define ADC_EXCHSELR_EXCHSEL                 ((uint8_t)0x01U)

/*  Bit definition for ADC_SSTR register  */
#define ADC_SSTR_SSTR                        ((uint8_t)0xFFU)

/*  Bit definition for ADC_ISR register  */
#define ADC_ISR_EOCAF_POS                    (0U)
#define ADC_ISR_EOCAF                        ((uint8_t)0x01U)
#define ADC_ISR_EOCBF_POS                    (1U)
#define ADC_ISR_EOCBF                        ((uint8_t)0x02U)

