SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/*  Bit definition for CMU_HRCCR register  */
#define CMU_HRCCR_HRCSTP_POS                 (0U)
#define CMU_HRCCR_HRCSTP                     ((uint8_t)0x01U)

/*  Bit definition for CMU_OSCSTBSR register  */
#define CMU_OSCSTBSR_HRCSTBF_POS             (0U)
#define CMU_OSCSTBSR_HRCSTBF                 ((uint8_t)0x01U)
#define CMU_OSCSTBSR_XTALSTBF_POS            (3U)
#define CMU_OSCSTBSR_XTALSTBF                ((uint8_t)0x08U)

/*  Bit definition for CMU_MCO1CFGR register  */
#define CMU_MCO1CFGR_MCO1SEL_POS             (0U)
#define CMU_MCO1CFGR_MCO1SEL                 ((uint8_t)0x0FU)
#define CMU_MCO1CFGR_MCO1SEL_0               ((uint8_t)0x01U)
#define CMU_MCO1CFGR_MCO1SEL_1               ((uint8_t)0x02U)
#define CMU_MCO1CFGR_MCO1SEL_2               ((uint8_t)0x04U)
#define CMU_MCO1CFGR_MCO1SEL_3               ((uint8_t)0x08U)
#define CMU_MCO1CFGR_MCO1DIV_POS             (4U)
#define CMU_MCO1CFGR_MCO1DIV                 ((uint8_t)0x70U)
#define CMU_MCO1CFGR_MCO1DIV_0               ((uint8_t)0x10U)
#define CMU_MCO1CFGR_MCO1DIV_1               ((uint8_t)0x20U)
#define CMU_MCO1CFGR_MCO1DIV_2               ((uint8_t)0x40U)
#define CMU_MCO1CFGR_MCO1EN_POS              (7U)
#define CMU_MCO1CFGR_MCO1EN                  ((uint8_t)0x80U)

/*  Bit definition for CMU_XTALSTDCR register  */
#define CMU_XTALSTDCR_XTALSTDIE_POS          (0U)
#define CMU_XTALSTDCR_XTALSTDIE              ((uint8_t)0x01U)
#define CMU_XTALSTDCR_XTALSTDRE_POS          (1U)
#define CMU_XTALSTDCR_XTALSTDRE              ((uint8_t)0x02U)
#define CMU_XTALSTDCR_XTALSTDRIS_POS         (2U)
#define CMU_XTALSTDCR_XTALSTDRIS             ((uint8_t)0x04U)
#define CMU_XTALSTDCR_XTALSTDE_POS           (7U)
#define CMU_XTALSTDCR_XTALSTDE               ((uint8_t)0x80U)

/*  Bit definition for CMU_FCG register  */
#define CMU_FCG_ADC_POS                      (0U)
#define CMU_FCG_ADC                          ((uint32_t)0x00000001U)
#define CMU_FCG_CTC_POS                      (1U)
#define CMU_FCG_CTC                          ((uint32_t)0x00000002U)
#define CMU_FCG_CMP_POS                      (2U)
#define CMU_FCG_CMP                          ((uint32_t)0x00000004U)
#define CMU_FCG_AOS_POS                      (4U)
#define CMU_FCG_AOS                          ((uint32_t)0x00000010U)
#define CMU_FCG_DMA_POS                      (5U)
#define CMU_FCG_DMA                          ((uint32_t)0x00000020U)
#define CMU_FCG_CRC_POS                      (7U)
#define CMU_FCG_CRC                          ((uint32_t)0x00000080U)
#define CMU_FCG_TIMB1_POS                    (8U)
#define CMU_FCG_TIMB1                        ((uint32_t)0x00000100U)
#define CMU_FCG_TIMB2_POS                    (9U)
#define CMU_FCG_TIMB2                        ((uint32_t)0x00000200U)
#define CMU_FCG_TIMB3_POS                    (10U)
#define CMU_FCG_TIMB3                        ((uint32_t)0x00000400U)
#define CMU_FCG_TIMB4_POS                    (11U)
#define CMU_FCG_TIMB4                        ((uint32_t)0x00000800U)
#define CMU_FCG_TIM0_POS                     (16U)
#define CMU_FCG_TIM0                         ((uint32_t)0x00010000U)
#define CMU_FCG_TIM2_POS                     (17U)
#define CMU_FCG_TIM2                         ((uint32_t)0x00020000U)
#define CMU_FCG_TIM4_POS                     (18U)
#define CMU_FCG_TIM4                         ((uint32_t)0x00040000U)
#define CMU_FCG_TIMA_POS                     (19U)
#define CMU_FCG_TIMA                         ((uint32_t)0x00080000U)
#define CMU_FCG_EMB_POS                      (20U)
#define CMU_FCG_EMB                          ((uint32_t)0x00100000U)
#define CMU_FCG_UART1_POS                    (24U)
#define CMU_FCG_UART1                        ((uint32_t)0x01000000U)
#define CMU_FCG_UART2_POS                    (25U)
#define CMU_FCG_UART2                        ((uint32_t)0x02000000U)
#define CMU_FCG_UART3_POS                    (26U)
#define CMU_FCG_UART3                        ((uint32_t)0x04000000U)
#define CMU_FCG_IIC_POS                      (28U)
#define CMU_FCG_IIC                          ((uint32_t)0x10000000U)
#define CMU_FCG_SPI_POS                      (29U)
#define CMU_FCG_SPI                          ((uint32_t)0x20000000U)

/*  Bit definition for CMU_LRCCR register  */
#define CMU_LRCCR_LRCSTP_POS                 (0U)
#define CMU_LRCCR_LRCSTP                     ((uint8_t)0x01U)


/*******************************************************************************
                Bit definition for Peripheral CRC
*******************************************************************************/
/*  Bit definition for CRC_CR register  */
#define CRC_CR_CR_POS                        (0U)
#define CRC_CR_CR                            ((uint32_t)0x00000001U)
#define CRC_CR_FLAG_POS                      (1U)
#define CRC_CR_FLAG                          ((uint32_t)0x00000002U)

/*  Bit definition for CRC_RESLT register  */
#define CRC_RESLT_RESLT                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT0 register  */
#define CRC_DAT0_DAT0                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT1 register  */
#define CRC_DAT1_DAT1                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT2 register  */
#define CRC_DAT2_DAT2                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT3 register  */
#define CRC_DAT3_DAT3                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT4 register  */
#define CRC_DAT4_DAT4                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT5 register  */
#define CRC_DAT5_DAT5                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT6 register  */
#define CRC_DAT6_DAT6                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT7 register  */
#define CRC_DAT7_DAT7                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT8 register  */
#define CRC_DAT8_DAT8                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT9 register  */
#define CRC_DAT9_DAT9                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT10 register  */
#define CRC_DAT10_DAT10                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT11 register  */
#define CRC_DAT11_DAT11                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT12 register  */
#define CRC_DAT12_DAT12                      ((uint32_t)0xFFFFFFFFU)

