SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/*  Bit definition for CRC_DAT13 register  */
#define CRC_DAT13_DAT13                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT14 register  */
#define CRC_DAT14_DAT14                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT15 register  */
#define CRC_DAT15_DAT15                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT16 register  */
#define CRC_DAT16_DAT16                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT17 register  */
#define CRC_DAT17_DAT17                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT18 register  */
#define CRC_DAT18_DAT18                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT19 register  */
#define CRC_DAT19_DAT19                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT20 register  */
#define CRC_DAT20_DAT20                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT21 register  */
#define CRC_DAT21_DAT21                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT22 register  */
#define CRC_DAT22_DAT22                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT23 register  */
#define CRC_DAT23_DAT23                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT24 register  */
#define CRC_DAT24_DAT24                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT25 register  */
#define CRC_DAT25_DAT25                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT26 register  */
#define CRC_DAT26_DAT26                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT27 register  */
#define CRC_DAT27_DAT27                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT28 register  */
#define CRC_DAT28_DAT28                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT29 register  */
#define CRC_DAT29_DAT29                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT30 register  */
#define CRC_DAT30_DAT30                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT31 register  */
#define CRC_DAT31_DAT31                      ((uint32_t)0xFFFFFFFFU)


/*******************************************************************************
                Bit definition for Peripheral CTC
*******************************************************************************/
/*  Bit definition for CTC_CR1 register  */
#define CTC_CR1_REFPSC_POS                   (0U)
#define CTC_CR1_REFPSC                       ((uint32_t)0x00000007U)
#define CTC_CR1_REFPSC_0                     ((uint32_t)0x00000001U)
#define CTC_CR1_REFPSC_1                     ((uint32_t)0x00000002U)
#define CTC_CR1_REFPSC_2                     ((uint32_t)0x00000004U)
#define CTC_CR1_REFCKS_POS                   (4U)
#define CTC_CR1_REFCKS                       ((uint32_t)0x00000030U)
#define CTC_CR1_REFCKS_0                     ((uint32_t)0x00000010U)
#define CTC_CR1_REFCKS_1                     ((uint32_t)0x00000020U)
#define CTC_CR1_ERRIE_POS                    (6U)
#define CTC_CR1_ERRIE                        ((uint32_t)0x00000040U)
#define CTC_CR1_CTCEN_POS                    (7U)
#define CTC_CR1_CTCEN                        ((uint32_t)0x00000080U)
#define CTC_CR1_TRMVAL_POS                   (16U)
#define CTC_CR1_TRMVAL                       ((uint32_t)0x003F0000U)
#define CTC_CR1_TRMVAL_0                     ((uint32_t)0x00010000U)
#define CTC_CR1_TRMVAL_1                     ((uint32_t)0x00020000U)
#define CTC_CR1_TRMVAL_2                     ((uint32_t)0x00040000U)
#define CTC_CR1_TRMVAL_3                     ((uint32_t)0x00080000U)
#define CTC_CR1_TRMVAL_4                     ((uint32_t)0x00100000U)
#define CTC_CR1_TRMVAL_5                     ((uint32_t)0x00200000U)

/*  Bit definition for CTC_CR2 register  */
#define CTC_CR2_OFSVAL_POS                   (0U)
#define CTC_CR2_OFSVAL                       ((uint32_t)0x000000FFU)
#define CTC_CR2_OFSVAL_0                     ((uint32_t)0x00000001U)
#define CTC_CR2_OFSVAL_1                     ((uint32_t)0x00000002U)
#define CTC_CR2_OFSVAL_2                     ((uint32_t)0x00000004U)
#define CTC_CR2_OFSVAL_3                     ((uint32_t)0x00000008U)
#define CTC_CR2_OFSVAL_4                     ((uint32_t)0x00000010U)
#define CTC_CR2_OFSVAL_5                     ((uint32_t)0x00000020U)
#define CTC_CR2_OFSVAL_6                     ((uint32_t)0x00000040U)
#define CTC_CR2_OFSVAL_7                     ((uint32_t)0x00000080U)
#define CTC_CR2_RLDVAL_POS                   (16U)
#define CTC_CR2_RLDVAL                       ((uint32_t)0xFFFF0000U)
#define CTC_CR2_RLDVAL_0                     ((uint32_t)0x00010000U)
#define CTC_CR2_RLDVAL_1                     ((uint32_t)0x00020000U)
#define CTC_CR2_RLDVAL_2                     ((uint32_t)0x00040000U)
#define CTC_CR2_RLDVAL_3                     ((uint32_t)0x00080000U)
#define CTC_CR2_RLDVAL_4                     ((uint32_t)0x00100000U)
#define CTC_CR2_RLDVAL_5                     ((uint32_t)0x00200000U)
#define CTC_CR2_RLDVAL_6                     ((uint32_t)0x00400000U)
#define CTC_CR2_RLDVAL_7                     ((uint32_t)0x00800000U)
#define CTC_CR2_RLDVAL_8                     ((uint32_t)0x01000000U)
#define CTC_CR2_RLDVAL_9                     ((uint32_t)0x02000000U)
#define CTC_CR2_RLDVAL_10                    ((uint32_t)0x04000000U)
#define CTC_CR2_RLDVAL_11                    ((uint32_t)0x08000000U)
#define CTC_CR2_RLDVAL_12                    ((uint32_t)0x10000000U)
#define CTC_CR2_RLDVAL_13                    ((uint32_t)0x20000000U)
#define CTC_CR2_RLDVAL_14                    ((uint32_t)0x40000000U)
#define CTC_CR2_RLDVAL_15                    ((uint32_t)0x80000000U)

/*  Bit definition for CTC_STR register  */
#define CTC_STR_TRIMOK_POS                   (0U)
#define CTC_STR_TRIMOK                       ((uint32_t)0x00000001U)
#define CTC_STR_TRMOVF_POS                   (1U)
#define CTC_STR_TRMOVF                       ((uint32_t)0x00000002U)
#define CTC_STR_TRMUDF_POS                   (2U)
#define CTC_STR_TRMUDF                       ((uint32_t)0x00000004U)
#define CTC_STR_CTCBSY_POS                   (3U)
#define CTC_STR_CTCBSY                       ((uint32_t)0x00000008U)


