SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/*******************************************************************************
                Bit definition for Peripheral ICG
*******************************************************************************/
/*  Bit definition for ICG_ICG0 register  */
#define ICG_ICG0_SWDTAUTS_POS                (0U)
#define ICG_ICG0_SWDTAUTS                    ((uint32_t)0x00000001U)
#define ICG_ICG0_SWDTITS_POS                 (1U)
#define ICG_ICG0_SWDTITS                     ((uint32_t)0x00000002U)
#define ICG_ICG0_SWDTPERI_POS                (2U)
#define ICG_ICG0_SWDTPERI                    ((uint32_t)0x0000000CU)
#define ICG_ICG0_SWDTPERI_0                  ((uint32_t)0x00000004U)
#define ICG_ICG0_SWDTPERI_1                  ((uint32_t)0x00000008U)
#define ICG_ICG0_SWDTCKS_POS                 (4U)
#define ICG_ICG0_SWDTCKS                     ((uint32_t)0x000000F0U)
#define ICG_ICG0_SWDTCKS_0                   ((uint32_t)0x00000010U)
#define ICG_ICG0_SWDTCKS_1                   ((uint32_t)0x00000020U)
#define ICG_ICG0_SWDTCKS_2                   ((uint32_t)0x00000040U)
#define ICG_ICG0_SWDTCKS_3                   ((uint32_t)0x00000080U)
#define ICG_ICG0_SWDTWDPT_POS                (8U)
#define ICG_ICG0_SWDTWDPT                    ((uint32_t)0x00000F00U)
#define ICG_ICG0_SWDTWDPT_0                  ((uint32_t)0x00000100U)
#define ICG_ICG0_SWDTWDPT_1                  ((uint32_t)0x00000200U)
#define ICG_ICG0_SWDTWDPT_2                  ((uint32_t)0x00000400U)
#define ICG_ICG0_SWDTWDPT_3                  ((uint32_t)0x00000800U)
#define ICG_ICG0_SWDTSLPOFF_POS              (12U)
#define ICG_ICG0_SWDTSLPOFF                  ((uint32_t)0x00001000U)
#define ICG_ICG0_HRCREQS_POS                 (16U)
#define ICG_ICG0_HRCREQS                     ((uint32_t)0x000F0000U)
#define ICG_ICG0_HRCREQS_0                   ((uint32_t)0x00010000U)
#define ICG_ICG0_HRCREQS_1                   ((uint32_t)0x00020000U)
#define ICG_ICG0_HRCREQS_2                   ((uint32_t)0x00040000U)
#define ICG_ICG0_HRCREQS_3                   ((uint32_t)0x00080000U)
#define ICG_ICG0_NMIFCLK_POS                 (26U)
#define ICG_ICG0_NMIFCLK                     ((uint32_t)0x0C000000U)
#define ICG_ICG0_NMIFCLK_0                   ((uint32_t)0x04000000U)
#define ICG_ICG0_NMIFCLK_1                   ((uint32_t)0x08000000U)
#define ICG_ICG0_NMIFEN_POS                  (28U)
#define ICG_ICG0_NMIFEN                      ((uint32_t)0x10000000U)
#define ICG_ICG0_NMITRG_POS                  (29U)
#define ICG_ICG0_NMITRG                      ((uint32_t)0x20000000U)
#define ICG_ICG0_NMIEN_POS                   (30U)
#define ICG_ICG0_NMIEN                       ((uint32_t)0x40000000U)
#define ICG_ICG0_NMIICGENA_POS               (31U)
#define ICG_ICG0_NMIICGENA                   ((uint32_t)0x80000000U)

/*  Bit definition for ICG_ICG1 register  */
#define ICG_ICG1_DFS_POS                     (0U)
#define ICG_ICG1_DFS                         ((uint32_t)0x00000003U)
#define ICG_ICG1_DFS_0                       ((uint32_t)0x00000001U)
#define ICG_ICG1_DFS_1                       ((uint32_t)0x00000002U)
#define ICG_ICG1_DFDIS_POS                   (2U)
#define ICG_ICG1_DFDIS                       ((uint32_t)0x00000004U)
#define ICG_ICG1_LVDLVL_POS                  (8U)
#define ICG_ICG1_LVDLVL                      ((uint32_t)0x00000F00U)
#define ICG_ICG1_LVDLVL_0                    ((uint32_t)0x00000100U)
#define ICG_ICG1_LVDLVL_1                    ((uint32_t)0x00000200U)
#define ICG_ICG1_LVDLVL_2                    ((uint32_t)0x00000400U)
#define ICG_ICG1_LVDLVL_3                    ((uint32_t)0x00000800U)
#define ICG_ICG1_NMIS_POS                    (12U)
#define ICG_ICG1_NMIS                        ((uint32_t)0x00001000U)
#define ICG_ICG1_IRS_POS                     (13U)
#define ICG_ICG1_IRS                         ((uint32_t)0x00002000U)
#define ICG_ICG1_IRDIS_POS                   (14U)
#define ICG_ICG1_IRDIS                       ((uint32_t)0x00004000U)
#define ICG_ICG1_LVDDIS_POS                  (15U)
#define ICG_ICG1_LVDDIS                      ((uint32_t)0x00008000U)

/*  Bit definition for ICG_ICG2 register  */
#define ICG_ICG2_ICG2                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG3 register  */
#define ICG_ICG3_ICG3                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG4 register  */
#define ICG_ICG4_ICG4                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG5 register  */
#define ICG_ICG5_ICG5                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG6 register  */
#define ICG_ICG6_ICG6                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG7 register  */
#define ICG_ICG7_ICG7                        ((uint32_t)0xFFFFFFFFU)


/*******************************************************************************
                Bit definition for Peripheral INTC
*******************************************************************************/
/*  Bit definition for INTC_NMICR register  */
#define INTC_NMICR_NMITRG_POS                (0U)
#define INTC_NMICR_NMITRG                    ((uint32_t)0x00000001U)
#define INTC_NMICR_NMIFCLK_POS               (4U)
#define INTC_NMICR_NMIFCLK                   ((uint32_t)0x00000030U)
#define INTC_NMICR_NMIFCLK_0                 ((uint32_t)0x00000010U)
#define INTC_NMICR_NMIFCLK_1                 ((uint32_t)0x00000020U)
#define INTC_NMICR_NMIFEN_POS                (7U)
#define INTC_NMICR_NMIFEN                    ((uint32_t)0x00000080U)

/*  Bit definition for INTC_NMIER register  */
#define INTC_NMIER_NMIEN_POS                 (0U)
#define INTC_NMIER_NMIEN                     ((uint32_t)0x00000001U)
#define INTC_NMIER_XTALSTPEN_POS             (1U)
#define INTC_NMIER_XTALSTPEN                 ((uint32_t)0x00000002U)
#define INTC_NMIER_SWDTEN_POS                (2U)
#define INTC_NMIER_SWDTEN                    ((uint32_t)0x00000004U)
#define INTC_NMIER_PVDEN_POS                 (3U)
#define INTC_NMIER_PVDEN                     ((uint32_t)0x00000008U)

/*  Bit definition for INTC_NMIFR register  */
#define INTC_NMIFR_NMIF_POS                  (0U)
#define INTC_NMIFR_NMIF                      ((uint32_t)0x00000001U)
#define INTC_NMIFR_XTALSTPF_POS              (1U)
#define INTC_NMIFR_XTALSTPF                  ((uint32_t)0x00000002U)
#define INTC_NMIFR_SWDTF_POS                 (2U)
#define INTC_NMIFR_SWDTF                     ((uint32_t)0x00000004U)
#define INTC_NMIFR_PVDF_POS                  (3U)
#define INTC_NMIFR_PVDF                      ((uint32_t)0x00000008U)

/*  Bit definition for INTC_NMICLR register  */
#define INTC_NMICLR_NMICL_POS                (0U)
#define INTC_NMICLR_NMICL                    ((uint32_t)0x00000001U)
#define INTC_NMICLR_XTALSTPCL_POS            (1U)
#define INTC_NMICLR_XTALSTPCL                ((uint32_t)0x00000002U)
#define INTC_NMICLR_SWDTCL_POS               (2U)
#define INTC_NMICLR_SWDTCL                   ((uint32_t)0x00000004U)
#define INTC_NMICLR_PVDCL_POS                (3U)
#define INTC_NMICLR_PVDCL                    ((uint32_t)0x00000008U)

