SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/*  Bit definition for INTC_ISELAR register  */
#define INTC_ISELAR_ISEL_POS                 (0U)
#define INTC_ISELAR_ISEL                     ((uint32_t)0x0000000FU)
#define INTC_ISELAR_ISEL_0                   ((uint32_t)0x00000001U)
#define INTC_ISELAR_ISEL_1                   ((uint32_t)0x00000002U)
#define INTC_ISELAR_ISEL_2                   ((uint32_t)0x00000004U)
#define INTC_ISELAR_ISEL_3                   ((uint32_t)0x00000008U)

/*  Bit definition for INTC_ISELBR register  */
#define INTC_ISELBR_ISEL_POS                 (1U)
#define INTC_ISELBR_ISEL                     ((uint32_t)0x0000FFFEU)
#define INTC_ISELBR_ISEL_1                   ((uint32_t)0x00000002U)
#define INTC_ISELBR_ISEL_2                   ((uint32_t)0x00000004U)
#define INTC_ISELBR_ISEL_3                   ((uint32_t)0x00000008U)
#define INTC_ISELBR_ISEL_4                   ((uint32_t)0x00000010U)
#define INTC_ISELBR_ISEL_5                   ((uint32_t)0x00000020U)
#define INTC_ISELBR_ISEL_6                   ((uint32_t)0x00000040U)
#define INTC_ISELBR_ISEL_7                   ((uint32_t)0x00000080U)
#define INTC_ISELBR_ISEL_8                   ((uint32_t)0x00000100U)
#define INTC_ISELBR_ISEL_9                   ((uint32_t)0x00000200U)
#define INTC_ISELBR_ISEL_10                  ((uint32_t)0x00000400U)
#define INTC_ISELBR_ISEL_11                  ((uint32_t)0x00000800U)
#define INTC_ISELBR_ISEL_12                  ((uint32_t)0x00001000U)
#define INTC_ISELBR_ISEL_13                  ((uint32_t)0x00002000U)
#define INTC_ISELBR_ISEL_14                  ((uint32_t)0x00004000U)
#define INTC_ISELBR_ISEL_15                  ((uint32_t)0x00008000U)


/*******************************************************************************
                Bit definition for Peripheral PORT
*******************************************************************************/
/*  Bit definition for PORT_PIDR0 register  */
#define PORT_PIDR0_PIN0_POS                  (0U)
#define PORT_PIDR0_PIN0                      ((uint8_t)0x01U)
#define PORT_PIDR0_PIN1_POS                  (1U)
#define PORT_PIDR0_PIN1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_PIDR1 register  */
#define PORT_PIDR1_PIN0_POS                  (0U)
#define PORT_PIDR1_PIN0                      ((uint8_t)0x01U)
#define PORT_PIDR1_PIN1_POS                  (1U)
#define PORT_PIDR1_PIN1                      ((uint8_t)0x02U)
#define PORT_PIDR1_PIN2_POS                  (2U)
#define PORT_PIDR1_PIN2                      ((uint8_t)0x04U)
#define PORT_PIDR1_PIN3_POS                  (3U)
#define PORT_PIDR1_PIN3                      ((uint8_t)0x08U)
#define PORT_PIDR1_PIN4_POS                  (4U)
#define PORT_PIDR1_PIN4                      ((uint8_t)0x10U)
#define PORT_PIDR1_PIN5_POS                  (5U)
#define PORT_PIDR1_PIN5                      ((uint8_t)0x20U)
#define PORT_PIDR1_PIN6_POS                  (6U)
#define PORT_PIDR1_PIN6                      ((uint8_t)0x40U)
#define PORT_PIDR1_PIN7_POS                  (7U)
#define PORT_PIDR1_PIN7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_PIDR2 register  */
#define PORT_PIDR2_PIN0_POS                  (0U)
#define PORT_PIDR2_PIN0                      ((uint8_t)0x01U)
#define PORT_PIDR2_PIN1_POS                  (1U)
#define PORT_PIDR2_PIN1                      ((uint8_t)0x02U)
#define PORT_PIDR2_PIN2_POS                  (2U)
#define PORT_PIDR2_PIN2                      ((uint8_t)0x04U)
#define PORT_PIDR2_PIN3_POS                  (3U)
#define PORT_PIDR2_PIN3                      ((uint8_t)0x08U)

/*  Bit definition for PORT_PIDR3 register  */
#define PORT_PIDR3_PIN0_POS                  (0U)
#define PORT_PIDR3_PIN0                      ((uint8_t)0x01U)
#define PORT_PIDR3_PIN1_POS                  (1U)
#define PORT_PIDR3_PIN1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_PIDR4 register  */
#define PORT_PIDR4_PIN0_POS                  (0U)
#define PORT_PIDR4_PIN0                      ((uint8_t)0x01U)

/*  Bit definition for PORT_PIDR5 register  */
#define PORT_PIDR5_PIN0_POS                  (0U)
#define PORT_PIDR5_PIN0                      ((uint8_t)0x01U)
#define PORT_PIDR5_PIN1_POS                  (1U)
#define PORT_PIDR5_PIN1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_PIDR6 register  */
#define PORT_PIDR6_PIN0_POS                  (0U)
#define PORT_PIDR6_PIN0                      ((uint8_t)0x01U)
#define PORT_PIDR6_PIN1_POS                  (1U)
#define PORT_PIDR6_PIN1                      ((uint8_t)0x02U)
#define PORT_PIDR6_PIN2_POS                  (2U)
#define PORT_PIDR6_PIN2                      ((uint8_t)0x04U)

/*  Bit definition for PORT_PIDR7 register  */
#define PORT_PIDR7_PIN0_POS                  (0U)
#define PORT_PIDR7_PIN0                      ((uint8_t)0x01U)

/*  Bit definition for PORT_PIDR12 register  */
#define PORT_PIDR12_PIN0_POS                 (0U)
#define PORT_PIDR12_PIN0                     ((uint8_t)0x01U)
#define PORT_PIDR12_PIN1_POS                 (1U)
#define PORT_PIDR12_PIN1                     ((uint8_t)0x02U)
#define PORT_PIDR12_PIN2_POS                 (2U)
#define PORT_PIDR12_PIN2                     ((uint8_t)0x04U)

/*  Bit definition for PORT_PIDR13 register  */
#define PORT_PIDR13_PIN7_POS                 (7U)
#define PORT_PIDR13_PIN7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PIDR14 register  */
#define PORT_PIDR14_PIN7_POS                 (7U)
#define PORT_PIDR14_PIN7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PODR0 register  */
#define PORT_PODR0_POUT0_POS                 (0U)
#define PORT_PODR0_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR0_POUT1_POS                 (1U)
#define PORT_PODR0_POUT1                     ((uint8_t)0x02U)

/*  Bit definition for PORT_PODR1 register  */
#define PORT_PODR1_POUT0_POS                 (0U)
#define PORT_PODR1_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR1_POUT1_POS                 (1U)
#define PORT_PODR1_POUT1                     ((uint8_t)0x02U)
#define PORT_PODR1_POUT2_POS                 (2U)
#define PORT_PODR1_POUT2                     ((uint8_t)0x04U)
#define PORT_PODR1_POUT3_POS                 (3U)
#define PORT_PODR1_POUT3                     ((uint8_t)0x08U)
#define PORT_PODR1_POUT4_POS                 (4U)
#define PORT_PODR1_POUT4                     ((uint8_t)0x10U)
#define PORT_PODR1_POUT5_POS                 (5U)
#define PORT_PODR1_POUT5                     ((uint8_t)0x20U)
#define PORT_PODR1_POUT6_POS                 (6U)
#define PORT_PODR1_POUT6                     ((uint8_t)0x40U)
#define PORT_PODR1_POUT7_POS                 (7U)
#define PORT_PODR1_POUT7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PODR2 register  */
#define PORT_PODR2_POUT0_POS                 (0U)
#define PORT_PODR2_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR2_POUT1_POS                 (1U)
#define PORT_PODR2_POUT1                     ((uint8_t)0x02U)
#define PORT_PODR2_POUT2_POS                 (2U)
#define PORT_PODR2_POUT2                     ((uint8_t)0x04U)
#define PORT_PODR2_POUT3_POS                 (3U)
#define PORT_PODR2_POUT3                     ((uint8_t)0x08U)

/*  Bit definition for PORT_PODR3 register  */
#define PORT_PODR3_POUT0_POS                 (0U)
#define PORT_PODR3_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR3_POUT1_POS                 (1U)
#define PORT_PODR3_POUT1                     ((uint8_t)0x02U)

/*  Bit definition for PORT_PODR4 register  */
#define PORT_PODR4_POUT0_POS                 (0U)
#define PORT_PODR4_POUT0                     ((uint8_t)0x01U)

/*  Bit definition for PORT_PODR5 register  */
#define PORT_PODR5_POUT0_POS                 (0U)
#define PORT_PODR5_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR5_POUT1_POS                 (1U)
#define PORT_PODR5_POUT1                     ((uint8_t)0x02U)

