SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/*  Bit definition for PORT_PODR6 register  */
#define PORT_PODR6_POUT0_POS                 (0U)
#define PORT_PODR6_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR6_POUT1_POS                 (1U)
#define PORT_PODR6_POUT1                     ((uint8_t)0x02U)
#define PORT_PODR6_POUT2_POS                 (2U)
#define PORT_PODR6_POUT2                     ((uint8_t)0x04U)

/*  Bit definition for PORT_PODR7 register  */
#define PORT_PODR7_POUT0_POS                 (0U)
#define PORT_PODR7_POUT0                     ((uint8_t)0x01U)

/*  Bit definition for PORT_PODR12 register  */
#define PORT_PODR12_POUT0_POS                (0U)
#define PORT_PODR12_POUT0                    ((uint8_t)0x01U)
#define PORT_PODR12_POUT1_POS                (1U)
#define PORT_PODR12_POUT1                    ((uint8_t)0x02U)
#define PORT_PODR12_POUT2_POS                (2U)
#define PORT_PODR12_POUT2                    ((uint8_t)0x04U)

/*  Bit definition for PORT_PODR13 register  */
#define PORT_PODR13_POUT7_POS                (7U)
#define PORT_PODR13_POUT7                    ((uint8_t)0x80U)

/*  Bit definition for PORT_PODR14 register  */
#define PORT_PODR14_POUT7_POS                (7U)
#define PORT_PODR14_POUT7                    ((uint8_t)0x80U)

/*  Bit definition for PORT_POER0 register  */
#define PORT_POER0_POUTE0_POS                (0U)
#define PORT_POER0_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER0_POUTE1_POS                (1U)
#define PORT_POER0_POUTE1                    ((uint8_t)0x02U)

/*  Bit definition for PORT_POER1 register  */
#define PORT_POER1_POUTE0_POS                (0U)
#define PORT_POER1_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER1_POUTE1_POS                (1U)
#define PORT_POER1_POUTE1                    ((uint8_t)0x02U)
#define PORT_POER1_POUTE2_POS                (2U)
#define PORT_POER1_POUTE2                    ((uint8_t)0x04U)
#define PORT_POER1_POUTE3_POS                (3U)
#define PORT_POER1_POUTE3                    ((uint8_t)0x08U)
#define PORT_POER1_POUTE4_POS                (4U)
#define PORT_POER1_POUTE4                    ((uint8_t)0x10U)
#define PORT_POER1_POUTE5_POS                (5U)
#define PORT_POER1_POUTE5                    ((uint8_t)0x20U)
#define PORT_POER1_POUTE6_POS                (6U)
#define PORT_POER1_POUTE6                    ((uint8_t)0x40U)
#define PORT_POER1_POUTE7_POS                (7U)
#define PORT_POER1_POUTE7                    ((uint8_t)0x80U)

/*  Bit definition for PORT_POER2 register  */
#define PORT_POER2_POUTE0_POS                (0U)
#define PORT_POER2_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER2_POUTE1_POS                (1U)
#define PORT_POER2_POUTE1                    ((uint8_t)0x02U)
#define PORT_POER2_POUTE2_POS                (2U)
#define PORT_POER2_POUTE2                    ((uint8_t)0x04U)
#define PORT_POER2_POUTE3_POS                (3U)
#define PORT_POER2_POUTE3                    ((uint8_t)0x08U)

/*  Bit definition for PORT_POER3 register  */
#define PORT_POER3_POUTE0_POS                (0U)
#define PORT_POER3_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER3_POUTE1_POS                (1U)
#define PORT_POER3_POUTE1                    ((uint8_t)0x02U)

/*  Bit definition for PORT_POER4 register  */
#define PORT_POER4_POUTE0_POS                (0U)
#define PORT_POER4_POUTE0                    ((uint8_t)0x01U)

/*  Bit definition for PORT_POER5 register  */
#define PORT_POER5_POUTE0_POS                (0U)
#define PORT_POER5_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER5_POUTE1_POS                (1U)
#define PORT_POER5_POUTE1                    ((uint8_t)0x02U)

/*  Bit definition for PORT_POER6 register  */
#define PORT_POER6_POUTE0_POS                (0U)
#define PORT_POER6_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER6_POUTE1_POS                (1U)
#define PORT_POER6_POUTE1                    ((uint8_t)0x02U)
#define PORT_POER6_POUTE2_POS                (2U)
#define PORT_POER6_POUTE2                    ((uint8_t)0x04U)

/*  Bit definition for PORT_POER7 register  */
#define PORT_POER7_POUTE0_POS                (0U)
#define PORT_POER7_POUTE0                    ((uint8_t)0x01U)

/*  Bit definition for PORT_POER12 register  */
#define PORT_POER12_POUTE0_POS               (0U)
#define PORT_POER12_POUTE0                   ((uint8_t)0x01U)
#define PORT_POER12_POUTE1_POS               (1U)
#define PORT_POER12_POUTE1                   ((uint8_t)0x02U)
#define PORT_POER12_POUTE2_POS               (2U)
#define PORT_POER12_POUTE2                   ((uint8_t)0x04U)

/*  Bit definition for PORT_POER13 register  */
#define PORT_POER13_POUTE7_POS               (7U)
#define PORT_POER13_POUTE7                   ((uint8_t)0x80U)

/*  Bit definition for PORT_POER14 register  */
#define PORT_POER14_POUTE7_POS               (7U)
#define PORT_POER14_POUTE7                   ((uint8_t)0x80U)

/*  Bit definition for PORT_POSR0 register  */
#define PORT_POSR0_POS0_POS                  (0U)
#define PORT_POSR0_POS0                      ((uint8_t)0x01U)
#define PORT_POSR0_POS1_POS                  (1U)
#define PORT_POSR0_POS1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POSR1 register  */
#define PORT_POSR1_POS0_POS                  (0U)
#define PORT_POSR1_POS0                      ((uint8_t)0x01U)
#define PORT_POSR1_POS1_POS                  (1U)
#define PORT_POSR1_POS1                      ((uint8_t)0x02U)
#define PORT_POSR1_POS2_POS                  (2U)
#define PORT_POSR1_POS2                      ((uint8_t)0x04U)
#define PORT_POSR1_POS3_POS                  (3U)
#define PORT_POSR1_POS3                      ((uint8_t)0x08U)
#define PORT_POSR1_POS4_POS                  (4U)
#define PORT_POSR1_POS4                      ((uint8_t)0x10U)
#define PORT_POSR1_POS5_POS                  (5U)
#define PORT_POSR1_POS5                      ((uint8_t)0x20U)
#define PORT_POSR1_POS6_POS                  (6U)
#define PORT_POSR1_POS6                      ((uint8_t)0x40U)
#define PORT_POSR1_POS7_POS                  (7U)
#define PORT_POSR1_POS7                      ((uint8_t)0x80U)

