SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/*  Bit definition for PORT_POTR0 register  */
#define PORT_POTR0_POT0_POS                  (0U)
#define PORT_POTR0_POT0                      ((uint8_t)0x01U)
#define PORT_POTR0_POT1_POS                  (1U)
#define PORT_POTR0_POT1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POTR1 register  */
#define PORT_POTR1_POT0_POS                  (0U)
#define PORT_POTR1_POT0                      ((uint8_t)0x01U)
#define PORT_POTR1_POT1_POS                  (1U)
#define PORT_POTR1_POT1                      ((uint8_t)0x02U)
#define PORT_POTR1_POT2_POS                  (2U)
#define PORT_POTR1_POT2                      ((uint8_t)0x04U)
#define PORT_POTR1_POT3_POS                  (3U)
#define PORT_POTR1_POT3                      ((uint8_t)0x08U)
#define PORT_POTR1_POT4_POS                  (4U)
#define PORT_POTR1_POT4                      ((uint8_t)0x10U)
#define PORT_POTR1_POT5_POS                  (5U)
#define PORT_POTR1_POT5                      ((uint8_t)0x20U)
#define PORT_POTR1_POT6_POS                  (6U)
#define PORT_POTR1_POT6                      ((uint8_t)0x40U)
#define PORT_POTR1_POT7_POS                  (7U)
#define PORT_POTR1_POT7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_POTR2 register  */
#define PORT_POTR2_POT0_POS                  (0U)
#define PORT_POTR2_POT0                      ((uint8_t)0x01U)
#define PORT_POTR2_POT1_POS                  (1U)
#define PORT_POTR2_POT1                      ((uint8_t)0x02U)
#define PORT_POTR2_POT2_POS                  (2U)
#define PORT_POTR2_POT2                      ((uint8_t)0x04U)
#define PORT_POTR2_POT3_POS                  (3U)
#define PORT_POTR2_POT3                      ((uint8_t)0x08U)

/*  Bit definition for PORT_POTR3 register  */
#define PORT_POTR3_POT0_POS                  (0U)
#define PORT_POTR3_POT0                      ((uint8_t)0x01U)
#define PORT_POTR3_POT1_POS                  (1U)
#define PORT_POTR3_POT1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POTR4 register  */
#define PORT_POTR4_POT0_POS                  (0U)
#define PORT_POTR4_POT0                      ((uint8_t)0x01U)

/*  Bit definition for PORT_POTR5 register  */
#define PORT_POTR5_POT0_POS                  (0U)
#define PORT_POTR5_POT0                      ((uint8_t)0x01U)
#define PORT_POTR5_POT1_POS                  (1U)
#define PORT_POTR5_POT1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POTR6 register  */
#define PORT_POTR6_POT0_POS                  (0U)
#define PORT_POTR6_POT0                      ((uint8_t)0x01U)
#define PORT_POTR6_POT1_POS                  (1U)
#define PORT_POTR6_POT1                      ((uint8_t)0x02U)
#define PORT_POTR6_POT2_POS                  (2U)
#define PORT_POTR6_POT2                      ((uint8_t)0x04U)

/*  Bit definition for PORT_POTR7 register  */
#define PORT_POTR7_POT0_POS                  (0U)
#define PORT_POTR7_POT0                      ((uint8_t)0x01U)

/*  Bit definition for PORT_POTR12 register  */
#define PORT_POTR12_POT0_POS                 (0U)
#define PORT_POTR12_POT0                     ((uint8_t)0x01U)
#define PORT_POTR12_POT1_POS                 (1U)
#define PORT_POTR12_POT1                     ((uint8_t)0x02U)
#define PORT_POTR12_POT2_POS                 (2U)
#define PORT_POTR12_POT2                     ((uint8_t)0x04U)

/*  Bit definition for PORT_POTR13 register  */
#define PORT_POTR13_POT7_POS                 (7U)
#define PORT_POTR13_POT7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_POTR14 register  */
#define PORT_POTR14_POT7_POS                 (7U)
#define PORT_POTR14_POT7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PCR register  */
#define PORT_PCR_POUT_POS                    (0U)
#define PORT_PCR_POUT                        ((uint16_t)0x0001U)
#define PORT_PCR_POUTE_POS                   (1U)
#define PORT_PCR_POUTE                       ((uint16_t)0x0002U)
#define PORT_PCR_NOD_POS                     (2U)
#define PORT_PCR_NOD                         ((uint16_t)0x0004U)
#define PORT_PCR_DRV_POS                     (4U)
#define PORT_PCR_DRV                         ((uint16_t)0x0010U)
#define PORT_PCR_LTE_POS                     (5U)
#define PORT_PCR_LTE                         ((uint16_t)0x0020U)
#define PORT_PCR_PUU_POS                     (6U)
#define PORT_PCR_PUU                         ((uint16_t)0x0040U)
#define PORT_PCR_PIN_POS                     (8U)
#define PORT_PCR_PIN                         ((uint16_t)0x0100U)
#define PORT_PCR_INVE_POS                    (9U)
#define PORT_PCR_INVE                        ((uint16_t)0x0200U)
#define PORT_PCR_CINSEL_POS                  (10U)
#define PORT_PCR_CINSEL                      ((uint16_t)0x0400U)
#define PORT_PCR_INTE_POS                    (11U)
#define PORT_PCR_INTE                        ((uint16_t)0x0800U)
#define PORT_PCR_FSEL_POS                    (12U)
#define PORT_PCR_FSEL                        ((uint16_t)0x7000U)
#define PORT_PCR_FSEL_0                      ((uint16_t)0x1000U)
#define PORT_PCR_FSEL_1                      ((uint16_t)0x2000U)
#define PORT_PCR_FSEL_2                      ((uint16_t)0x4000U)

/*  Bit definition for PORT_PSPCR register  */
#define PORT_PSPCR_SPFE_POS                  (0U)
#define PORT_PSPCR_SPFE                      ((uint16_t)0x0003U)
#define PORT_PSPCR_SPFE_0                    ((uint16_t)0x0001U)
#define PORT_PSPCR_SPFE_1                    ((uint16_t)0x0002U)

/*  Bit definition for PORT_PCCR register  */
#define PORT_PCCR_RDWT_POS                   (14U)
#define PORT_PCCR_RDWT                       ((uint16_t)0xC000U)
#define PORT_PCCR_RDWT_0                     ((uint16_t)0x4000U)
#define PORT_PCCR_RDWT_1                     ((uint16_t)0x8000U)

/*  Bit definition for PORT_PINAER register  */
#define PORT_PINAER_PINAE0_POS               (0U)
#define PORT_PINAER_PINAE0                   ((uint16_t)0x0001U)
#define PORT_PINAER_PINAE1_POS               (1U)
#define PORT_PINAER_PINAE1                   ((uint16_t)0x0002U)
#define PORT_PINAER_PINAE2_POS               (2U)
#define PORT_PINAER_PINAE2                   ((uint16_t)0x0004U)
#define PORT_PINAER_PINAE3_POS               (3U)
#define PORT_PINAER_PINAE3                   ((uint16_t)0x0008U)
#define PORT_PINAER_PINAE4_POS               (4U)
#define PORT_PINAER_PINAE4                   ((uint16_t)0x0010U)
#define PORT_PINAER_PINAE5_POS               (5U)
#define PORT_PINAER_PINAE5                   ((uint16_t)0x0020U)
#define PORT_PINAER_PINAE6_POS               (6U)
#define PORT_PINAER_PINAE6                   ((uint16_t)0x0040U)
#define PORT_PINAER_PINAE7_POS               (7U)
#define PORT_PINAER_PINAE7                   ((uint16_t)0x0080U)
#define PORT_PINAER_PINAE12_POS              (12U)
#define PORT_PINAER_PINAE12                  ((uint16_t)0x1000U)
#define PORT_PINAER_PINAE13_POS              (13U)
#define PORT_PINAER_PINAE13                  ((uint16_t)0x2000U)
#define PORT_PINAER_PINAE14_POS              (14U)
#define PORT_PINAER_PINAE14                  ((uint16_t)0x4000U)

/*  Bit definition for PORT_PWPR register  */
#define PORT_PWPR_WE_POS                     (0U)
#define PORT_PWPR_WE                         ((uint16_t)0x0001U)
#define PORT_PWPR_WP_POS                     (8U)
#define PORT_PWPR_WP                         ((uint16_t)0xFF00U)
#define PORT_PWPR_WP_0                       ((uint16_t)0x0100U)
#define PORT_PWPR_WP_1                       ((uint16_t)0x0200U)
#define PORT_PWPR_WP_2                       ((uint16_t)0x0400U)
#define PORT_PWPR_WP_3                       ((uint16_t)0x0800U)
#define PORT_PWPR_WP_4                       ((uint16_t)0x1000U)
#define PORT_PWPR_WP_5                       ((uint16_t)0x2000U)
#define PORT_PWPR_WP_6                       ((uint16_t)0x4000U)
#define PORT_PWPR_WP_7                       ((uint16_t)0x8000U)


