SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
/*  Bit definition for TMRB_CCONR register  */
#define TMRB_CCONR_CAPMDA_POS                (0U)
#define TMRB_CCONR_CAPMDA                    ((uint16_t)0x0001U)
#define TMRB_CCONR_HICP0_POS                 (4U)
#define TMRB_CCONR_HICP0                     ((uint16_t)0x0010U)
#define TMRB_CCONR_HICP1_POS                 (5U)
#define TMRB_CCONR_HICP1                     ((uint16_t)0x0020U)
#define TMRB_CCONR_HICP2_POS                 (6U)
#define TMRB_CCONR_HICP2                     ((uint16_t)0x0040U)
#define TMRB_CCONR_NOFIENCP_POS              (12U)
#define TMRB_CCONR_NOFIENCP                  ((uint16_t)0x1000U)
#define TMRB_CCONR_NOFICKCP_POS              (13U)
#define TMRB_CCONR_NOFICKCP                  ((uint16_t)0x6000U)
#define TMRB_CCONR_NOFICKCP_0                ((uint16_t)0x2000U)
#define TMRB_CCONR_NOFICKCP_1                ((uint16_t)0x4000U)

/*  Bit definition for TMRB_PCONR register  */
#define TMRB_PCONR_STAC_POS                  (0U)
#define TMRB_PCONR_STAC                      ((uint16_t)0x0003U)
#define TMRB_PCONR_STAC_0                    ((uint16_t)0x0001U)
#define TMRB_PCONR_STAC_1                    ((uint16_t)0x0002U)
#define TMRB_PCONR_STPC_POS                  (2U)
#define TMRB_PCONR_STPC                      ((uint16_t)0x000CU)
#define TMRB_PCONR_STPC_0                    ((uint16_t)0x0004U)
#define TMRB_PCONR_STPC_1                    ((uint16_t)0x0008U)
#define TMRB_PCONR_CMPC_POS                  (4U)
#define TMRB_PCONR_CMPC                      ((uint16_t)0x0030U)
#define TMRB_PCONR_CMPC_0                    ((uint16_t)0x0010U)
#define TMRB_PCONR_CMPC_1                    ((uint16_t)0x0020U)
#define TMRB_PCONR_PERC_POS                  (6U)
#define TMRB_PCONR_PERC                      ((uint16_t)0x00C0U)
#define TMRB_PCONR_PERC_0                    ((uint16_t)0x0040U)
#define TMRB_PCONR_PERC_1                    ((uint16_t)0x0080U)
#define TMRB_PCONR_FORC_POS                  (8U)
#define TMRB_PCONR_FORC                      ((uint16_t)0x0300U)
#define TMRB_PCONR_FORC_0                    ((uint16_t)0x0100U)
#define TMRB_PCONR_FORC_1                    ((uint16_t)0x0200U)
#define TMRB_PCONR_OUTEN_POS                 (12U)
#define TMRB_PCONR_OUTEN                     ((uint16_t)0x1000U)


/*******************************************************************************
                Bit definition for Peripheral USART
*******************************************************************************/
/*  Bit definition for USART_SR register  */
#define USART_SR_PE_POS                      (0U)
#define USART_SR_PE                          ((uint32_t)0x00000001U)
#define USART_SR_FE_POS                      (1U)
#define USART_SR_FE                          ((uint32_t)0x00000002U)
#define USART_SR_ORE_POS                     (3U)
#define USART_SR_ORE                         ((uint32_t)0x00000008U)
#define USART_SR_RXNE_POS                    (5U)
#define USART_SR_RXNE                        ((uint32_t)0x00000020U)
#define USART_SR_TC_POS                      (6U)
#define USART_SR_TC                          ((uint32_t)0x00000040U)
#define USART_SR_TXE_POS                     (7U)
#define USART_SR_TXE                         ((uint32_t)0x00000080U)
#define USART_SR_MPB_POS                     (16U)
#define USART_SR_MPB                         ((uint32_t)0x00010000U)

/*  Bit definition for USART_DR register  */
#define USART_DR_TDR_POS                     (0U)
#define USART_DR_TDR                         ((uint32_t)0x000001FFU)
#define USART_DR_TDR_0                       ((uint32_t)0x00000001U)
#define USART_DR_TDR_1                       ((uint32_t)0x00000002U)
#define USART_DR_TDR_2                       ((uint32_t)0x00000004U)
#define USART_DR_TDR_3                       ((uint32_t)0x00000008U)
#define USART_DR_TDR_4                       ((uint32_t)0x00000010U)
#define USART_DR_TDR_5                       ((uint32_t)0x00000020U)
#define USART_DR_TDR_6                       ((uint32_t)0x00000040U)
#define USART_DR_TDR_7                       ((uint32_t)0x00000080U)
#define USART_DR_TDR_8                       ((uint32_t)0x00000100U)
#define USART_DR_MPID_POS                    (9U)
#define USART_DR_MPID                        ((uint32_t)0x00000200U)
#define USART_DR_RDR_POS                     (16U)
#define USART_DR_RDR                         ((uint32_t)0x01FF0000U)
#define USART_DR_RDR_0                       ((uint32_t)0x00010000U)
#define USART_DR_RDR_1                       ((uint32_t)0x00020000U)
#define USART_DR_RDR_2                       ((uint32_t)0x00040000U)
#define USART_DR_RDR_3                       ((uint32_t)0x00080000U)
#define USART_DR_RDR_4                       ((uint32_t)0x00100000U)
#define USART_DR_RDR_5                       ((uint32_t)0x00200000U)
#define USART_DR_RDR_6                       ((uint32_t)0x00400000U)
#define USART_DR_RDR_7                       ((uint32_t)0x00800000U)
#define USART_DR_RDR_8                       ((uint32_t)0x01000000U)

/*  Bit definition for USART_BRR register  */
#define USART_BRR_DIV_INTEGER_POS            (8U)
#define USART_BRR_DIV_INTEGER                ((uint32_t)0x0000FF00U)
#define USART_BRR_DIV_INTEGER_0              ((uint32_t)0x00000100U)
#define USART_BRR_DIV_INTEGER_1              ((uint32_t)0x00000200U)
#define USART_BRR_DIV_INTEGER_2              ((uint32_t)0x00000400U)
#define USART_BRR_DIV_INTEGER_3              ((uint32_t)0x00000800U)
#define USART_BRR_DIV_INTEGER_4              ((uint32_t)0x00001000U)
#define USART_BRR_DIV_INTEGER_5              ((uint32_t)0x00002000U)
#define USART_BRR_DIV_INTEGER_6              ((uint32_t)0x00004000U)
#define USART_BRR_DIV_INTEGER_7              ((uint32_t)0x00008000U)

/*  Bit definition for USART_CR1 register  */
#define USART_CR1_RE_POS                     (2U)
#define USART_CR1_RE                         ((uint32_t)0x00000004U)
#define USART_CR1_TE_POS                     (3U)
#define USART_CR1_TE                         ((uint32_t)0x00000008U)
#define USART_CR1_SLME_POS                   (4U)
#define USART_CR1_SLME                       ((uint32_t)0x00000010U)
#define USART_CR1_RIE_POS                    (5U)
#define USART_CR1_RIE                        ((uint32_t)0x00000020U)
#define USART_CR1_TCIE_POS                   (6U)
#define USART_CR1_TCIE                       ((uint32_t)0x00000040U)
#define USART_CR1_TXEIE_POS                  (7U)
#define USART_CR1_TXEIE                      ((uint32_t)0x00000080U)
#define USART_CR1_PS_POS                     (9U)
#define USART_CR1_PS                         ((uint32_t)0x00000200U)
#define USART_CR1_PCE_POS                    (10U)
#define USART_CR1_PCE                        ((uint32_t)0x00000400U)
#define USART_CR1_M_POS                      (12U)
#define USART_CR1_M                          ((uint32_t)0x00001000U)
#define USART_CR1_OVER8_POS                  (15U)
#define USART_CR1_OVER8                      ((uint32_t)0x00008000U)
#define USART_CR1_CPE_POS                    (16U)
#define USART_CR1_CPE                        ((uint32_t)0x00010000U)
#define USART_CR1_CFE_POS                    (17U)
#define USART_CR1_CFE                        ((uint32_t)0x00020000U)
#define USART_CR1_CORE_POS                   (19U)
#define USART_CR1_CORE                       ((uint32_t)0x00080000U)
#define USART_CR1_MS_POS                     (24U)
#define USART_CR1_MS                         ((uint32_t)0x01000000U)
#define USART_CR1_ML_POS                     (28U)
#define USART_CR1_ML                         ((uint32_t)0x10000000U)
#define USART_CR1_NFE_POS                    (30U)
#define USART_CR1_NFE                        ((uint32_t)0x40000000U)
#define USART_CR1_SBS_POS                    (31U)
#define USART_CR1_SBS                        ((uint32_t)0x80000000U)

