SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
typedef struct
{
    uint32_t RESV0_0;
    uint32_t RESV0_1;
    uint32_t RESV0_2;
    uint32_t RESV0_3;
    uint32_t RESV0_4;
    uint32_t RESV0_5;
    uint32_t RESV0_6;
    uint32_t RESV0_7;
    uint32_t RESV0_8;
    uint32_t RESV0_9;
    uint32_t RESV0_10;
    uint32_t RESV0_11;
    uint32_t RESV0_12;
    uint32_t RESV0_13;
    uint32_t RESV0_14;
    uint32_t RESV0_15;
    uint32_t RESV0_16;
    uint32_t RESV0_17;
    uint32_t RESV0_18;
    uint32_t RESV0_19;
    uint32_t RESV0_20;
    uint32_t RESV0_21;
    uint32_t RESV0_22;
    uint32_t RESV0_23;
    uint32_t RESV0_24;
    uint32_t RESV0_25;
    uint32_t RESV0_26;
    uint32_t RESV0_27;
    uint32_t RESV0_28;
    uint32_t RESV0_29;
    uint32_t RESV0_30;
    uint32_t RESV0_31;
} stc_dbgc_t_resv0_bit_t;

typedef struct
{
    __IO uint32_t AUTH;
    __IO uint32_t REMVLOCK;
    __IO uint32_t SAFTYLOCK1;
    __IO uint32_t SAFTYLOCK2;
    uint32_t RESERVED0[4];
    __IO uint32_t MCUSTAT0;
    __IO uint32_t MCUSTAT1;
    uint32_t RESERVED1[22];
} stc_dbgc_t_mcustat_bit_t;

typedef struct
{
    __IO uint32_t EDBGRQ;
    __IO uint32_t RESTART;
    uint32_t RESERVED0[6];
    __IO uint32_t DIRQ;
    uint32_t RESERVED1[23];
} stc_dbgc_t_mcuctl_bit_t;

typedef struct
{
    __IO uint32_t ERASEREQ;
    __IO uint32_t ERASEACK;
    __IO uint32_t ERASEERR;
    uint32_t RESERVED0[29];
} stc_dbgc_t_fmcctl_bit_t;

typedef struct
{
    __IO uint32_t EN;
    uint32_t RESERVED0[31];
} stc_dma_en_bit_t;

typedef struct
{
    __IO uint32_t TRNERR0;
    __IO uint32_t TRNERR1;
    uint32_t RESERVED0[14];
    __IO uint32_t REQERR0;
    __IO uint32_t REQERR1;
    uint32_t RESERVED1[14];
} stc_dma_intstat0_bit_t;

typedef struct
{
    __IO uint32_t TC0;
    __IO uint32_t TC1;
    uint32_t RESERVED0[14];
    __IO uint32_t BTC0;
    __IO uint32_t BTC1;
    uint32_t RESERVED1[14];
} stc_dma_intstat1_bit_t;

typedef struct
{
    __IO uint32_t MSKTRNERR0;
    __IO uint32_t MSKTRNERR1;
    uint32_t RESERVED0[14];
    __IO uint32_t MSKREQERR0;
    __IO uint32_t MSKREQERR1;
    uint32_t RESERVED1[14];
} stc_dma_intmask0_bit_t;

typedef struct
{
    __IO uint32_t MSKTC0;
    __IO uint32_t MSKTC1;
    uint32_t RESERVED0[14];
    __IO uint32_t MSKBTC0;
    __IO uint32_t MSKBTC1;
    uint32_t RESERVED1[14];
} stc_dma_intmask1_bit_t;

typedef struct
{
    __IO uint32_t CLRTRNERR0;
    __IO uint32_t CLRTRNERR1;
    uint32_t RESERVED0[14];
    __IO uint32_t CLRREQERR0;
    __IO uint32_t CLRREQERR1;
    uint32_t RESERVED1[14];
} stc_dma_intclr0_bit_t;

typedef struct
{
    __IO uint32_t CLRTC0;
    __IO uint32_t CLRTC1;
    uint32_t RESERVED0[14];
    __IO uint32_t CLRBTC0;
    __IO uint32_t CLRBTC1;
    uint32_t RESERVED1[14];
} stc_dma_intclr1_bit_t;

typedef struct
{
    __IO uint32_t CHEN0;
    __IO uint32_t CHEN1;
    uint32_t RESERVED0[30];
} stc_dma_chen_bit_t;

typedef struct
{
    __IO uint32_t DMAACT;
    uint32_t RESERVED0[15];
    __IO uint32_t CHACT0;
    __IO uint32_t CHACT1;
    uint32_t RESERVED1[14];
} stc_dma_chstat_bit_t;

typedef struct
{
    __IO uint32_t CHENCLR0;
    __IO uint32_t CHENCLR1;
    uint32_t RESERVED0[30];
} stc_dma_chenclr_bit_t;

typedef struct
{
    uint32_t SAR0_0;
    uint32_t SAR0_1;
    uint32_t SAR0_2;
    uint32_t SAR0_3;
    uint32_t SAR0_4;
    uint32_t SAR0_5;
    uint32_t SAR0_6;
    uint32_t SAR0_7;
    uint32_t SAR0_8;
    uint32_t SAR0_9;
    uint32_t SAR0_10;
    uint32_t SAR0_11;
    uint32_t SAR0_12;
    uint32_t SAR0_13;
    uint32_t SAR0_14;
    uint32_t SAR0_15;
    uint32_t SAR0_16;
    uint32_t SAR0_17;
    uint32_t SAR0_18;
    uint32_t SAR0_19;
    uint32_t SAR0_20;
    uint32_t SAR0_21;
    uint32_t SAR0_22;
    uint32_t SAR0_23;
    uint32_t SAR0_24;
    uint32_t SAR0_25;
    uint32_t SAR0_26;
    uint32_t SAR0_27;
    uint32_t SAR0_28;
    uint32_t SAR0_29;
    uint32_t SAR0_30;
    uint32_t SAR0_31;
} stc_dma_sar0_bit_t;

typedef struct
{
    uint32_t DAR0_0;
    uint32_t DAR0_1;
    uint32_t DAR0_2;
    uint32_t DAR0_3;
    uint32_t DAR0_4;
    uint32_t DAR0_5;
    uint32_t DAR0_6;
    uint32_t DAR0_7;
    uint32_t DAR0_8;
    uint32_t DAR0_9;
    uint32_t DAR0_10;
    uint32_t DAR0_11;
    uint32_t DAR0_12;
    uint32_t DAR0_13;
    uint32_t DAR0_14;
    uint32_t DAR0_15;
    uint32_t DAR0_16;
    uint32_t DAR0_17;
    uint32_t DAR0_18;
    uint32_t DAR0_19;
    uint32_t DAR0_20;
    uint32_t DAR0_21;
    uint32_t DAR0_22;
    uint32_t DAR0_23;
    uint32_t DAR0_24;
    uint32_t DAR0_25;
    uint32_t DAR0_26;
    uint32_t DAR0_27;
    uint32_t DAR0_28;
    uint32_t DAR0_29;
    uint32_t DAR0_30;
    uint32_t DAR0_31;
} stc_dma_dar0_bit_t;

typedef struct
{
    __IO uint32_t BLKSIZE0;
    __IO uint32_t BLKSIZE1;
    __IO uint32_t BLKSIZE2;
    __IO uint32_t BLKSIZE3;
    __IO uint32_t BLKSIZE4;
    __IO uint32_t BLKSIZE5;
    __IO uint32_t BLKSIZE6;
    __IO uint32_t BLKSIZE7;
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
} stc_dma_ch0ctl0_bit_t;

typedef struct
{
    __IO uint32_t OFFSET0;
    __IO uint32_t OFFSET1;
    __IO uint32_t OFFSET2;
    __IO uint32_t OFFSET3;
    __IO uint32_t OFFSET4;
    __IO uint32_t OFFSET5;
    __IO uint32_t OFFSET6;
    __IO uint32_t OFFSET7;
    __IO uint32_t OFFSET8;
    __IO uint32_t OFFSET9;
    __IO uint32_t OFFSET10;
    __IO uint32_t OFFSET11;
    __IO uint32_t OFFSET12;
    __IO uint32_t OFFSET13;
    __IO uint32_t OFFSET14;
    __IO uint32_t OFFSET15;
    __IO uint32_t RPTNSCNT0;
    __IO uint32_t RPTNSCNT1;
    __IO uint32_t RPTNSCNT2;
    __IO uint32_t RPTNSCNT3;
    __IO uint32_t RPTNSCNT4;
    __IO uint32_t RPTNSCNT5;
    __IO uint32_t RPTNSCNT6;
    __IO uint32_t RPTNSCNT7;
    __IO uint32_t RPTNSEN;
    __IO uint32_t RPTNSSEL0;
    __IO uint32_t RPTNSSEL1;
    uint32_t RESERVED0[1];
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
} stc_dma_ch0ctl1_bit_t;

typedef struct
{
    uint32_t SAR1_0;
    uint32_t SAR1_1;
    uint32_t SAR1_2;
    uint32_t SAR1_3;
    uint32_t SAR1_4;
    uint32_t SAR1_5;
    uint32_t SAR1_6;
    uint32_t SAR1_7;
    uint32_t SAR1_8;
    uint32_t SAR1_9;
    uint32_t SAR1_10;
    uint32_t SAR1_11;
    uint32_t SAR1_12;
    uint32_t SAR1_13;
    uint32_t SAR1_14;
    uint32_t SAR1_15;
    uint32_t SAR1_16;
    uint32_t SAR1_17;
    uint32_t SAR1_18;
    uint32_t SAR1_19;
    uint32_t SAR1_20;
    uint32_t SAR1_21;
    uint32_t SAR1_22;
    uint32_t SAR1_23;
    uint32_t SAR1_24;
    uint32_t SAR1_25;
    uint32_t SAR1_26;
    uint32_t SAR1_27;
    uint32_t SAR1_28;
    uint32_t SAR1_29;
    uint32_t SAR1_30;
    uint32_t SAR1_31;
} stc_dma_sar1_bit_t;

typedef struct
{
    uint32_t DAR1_0;
    uint32_t DAR1_1;
    uint32_t DAR1_2;
    uint32_t DAR1_3;
    uint32_t DAR1_4;
    uint32_t DAR1_5;
    uint32_t DAR1_6;
    uint32_t DAR1_7;
    uint32_t DAR1_8;
    uint32_t DAR1_9;
    uint32_t DAR1_10;
    uint32_t DAR1_11;
    uint32_t DAR1_12;
    uint32_t DAR1_13;
    uint32_t DAR1_14;
    uint32_t DAR1_15;
    uint32_t DAR1_16;
    uint32_t DAR1_17;
    uint32_t DAR1_18;
    uint32_t DAR1_19;
    uint32_t DAR1_20;
    uint32_t DAR1_21;
    uint32_t DAR1_22;
    uint32_t DAR1_23;
    uint32_t DAR1_24;
    uint32_t DAR1_25;
    uint32_t DAR1_26;
    uint32_t DAR1_27;
    uint32_t DAR1_28;
    uint32_t DAR1_29;
    uint32_t DAR1_30;
    uint32_t DAR1_31;
} stc_dma_dar1_bit_t;

typedef struct
{
    __IO uint32_t BLKSIZE0;
    __IO uint32_t BLKSIZE1;
    __IO uint32_t BLKSIZE2;
    __IO uint32_t BLKSIZE3;
    __IO uint32_t BLKSIZE4;
    __IO uint32_t BLKSIZE5;
    __IO uint32_t BLKSIZE6;
    __IO uint32_t BLKSIZE7;
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
} stc_dma_ch1ctl0_bit_t;

typedef struct
{
    __IO uint32_t OFFSET0;
    __IO uint32_t OFFSET1;
    __IO uint32_t OFFSET2;
    __IO uint32_t OFFSET3;
    __IO uint32_t OFFSET4;
    __IO uint32_t OFFSET5;
    __IO uint32_t OFFSET6;
    __IO uint32_t OFFSET7;
    __IO uint32_t OFFSET8;
    __IO uint32_t OFFSET9;
    __IO uint32_t OFFSET10;
    __IO uint32_t OFFSET11;
    __IO uint32_t OFFSET12;
    __IO uint32_t OFFSET13;
    __IO uint32_t OFFSET14;
    __IO uint32_t OFFSET15;
    __IO uint32_t RPTNSCNT0;
    __IO uint32_t RPTNSCNT1;
    __IO uint32_t RPTNSCNT2;
    __IO uint32_t RPTNSCNT3;
    __IO uint32_t RPTNSCNT4;
    __IO uint32_t RPTNSCNT5;
    __IO uint32_t RPTNSCNT6;
    __IO uint32_t RPTNSCNT7;
    __IO uint32_t RPTNSEN;
    __IO uint32_t RPTNSSEL0;
    __IO uint32_t RPTNSSEL1;
    uint32_t RESERVED0[1];
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
} stc_dma_ch1ctl1_bit_t;

typedef struct
{
    __IO uint32_t FAPRT0;
    __IO uint32_t FAPRT1;
    __IO uint32_t FAPRT2;
    __IO uint32_t FAPRT3;
    __IO uint32_t FAPRT4;
    __IO uint32_t FAPRT5;
    __IO uint32_t FAPRT6;
    __IO uint32_t FAPRT7;
    __IO uint32_t FAPRT8;
    __IO uint32_t FAPRT9;
    __IO uint32_t FAPRT10;
    __IO uint32_t FAPRT11;
    __IO uint32_t FAPRT12;
    __IO uint32_t FAPRT13;
    __IO uint32_t FAPRT14;
    __IO uint32_t FAPRT15;
    uint32_t RESERVED0[16];
} stc_efm_faprt_bit_t;

typedef struct
{
    __IO uint32_t FSTP;
    uint32_t RESERVED0[31];
} stc_efm_fstp_bit_t;

typedef struct
{
    __IO uint32_t FLWT;
    uint32_t RESERVED0[15];
    __IO uint32_t CACHE;
    __IO uint32_t PREFETE;
    __IO uint32_t CRST0;
    uint32_t RESERVED1[13];
} stc_efm_frmc_bit_t;

typedef struct
{
    __IO uint32_t PEMODE;
    uint32_t RESERVED0[3];
    __IO uint32_t PEMOD0;
    __IO uint32_t PEMOD1;
    __IO uint32_t PEMOD2;
    uint32_t RESERVED1[1];
    __IO uint32_t BUSHLDCTL;
    uint32_t RESERVED2[23];
} stc_efm_fwmc_bit_t;

typedef struct
{
    __IO uint32_t PEWERR;
    __IO uint32_t PEPRTERR;
    uint32_t RESERVED0[1];
    __IO uint32_t PGMISMTCH;
    __IO uint32_t OPTEND;
    __IO uint32_t RDCOLERR;
    uint32_t RESERVED1[2];
    __IO uint32_t RDY;
    uint32_t RESERVED2[23];
} stc_efm_fsr_bit_t;

typedef struct
{
    __IO uint32_t PEWERRCLR;
    __IO uint32_t PEPRTERRCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t PGMISMTCHCLR;
    __IO uint32_t OPTENDCLR;
    __IO uint32_t RDCOLERRCLR;
    uint32_t RESERVED1[26];
} stc_efm_fsclr_bit_t;

typedef struct
{
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t RDCOLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

typedef struct
{
    __IO uint32_t FPMTSW0;
    __IO uint32_t FPMTSW1;
    __IO uint32_t FPMTSW2;
    __IO uint32_t FPMTSW3;
    __IO uint32_t FPMTSW4;
    __IO uint32_t FPMTSW5;
    __IO uint32_t FPMTSW6;
    __IO uint32_t FPMTSW7;
    __IO uint32_t FPMTSW8;
    __IO uint32_t FPMTSW9;
    __IO uint32_t FPMTSW10;
    __IO uint32_t FPMTSW11;
    __IO uint32_t FPMTSW12;
    __IO uint32_t FPMTSW13;
    __IO uint32_t FPMTSW14;
    uint32_t RESERVED0[17];
} stc_efm_fpmtsw_bit_t;

typedef struct
{
    __IO uint32_t FPMTEW0;
    __IO uint32_t FPMTEW1;
    __IO uint32_t FPMTEW2;
    __IO uint32_t FPMTEW3;
    __IO uint32_t FPMTEW4;
    __IO uint32_t FPMTEW5;
    __IO uint32_t FPMTEW6;
    __IO uint32_t FPMTEW7;
    __IO uint32_t FPMTEW8;
    __IO uint32_t FPMTEW9;
    __IO uint32_t FPMTEW10;
    __IO uint32_t FPMTEW11;
    __IO uint32_t FPMTEW12;
    __IO uint32_t FPMTEW13;
    __IO uint32_t FPMTEW14;
    uint32_t RESERVED0[17];
} stc_efm_fpmtew_bit_t;

typedef struct
{
    uint32_t UQID0_0;
    uint32_t UQID0_1;
    uint32_t UQID0_2;
    uint32_t UQID0_3;
    uint32_t UQID0_4;
    uint32_t UQID0_5;
    uint32_t UQID0_6;
    uint32_t UQID0_7;
    uint32_t UQID0_8;
    uint32_t UQID0_9;
    uint32_t UQID0_10;
    uint32_t UQID0_11;
    uint32_t UQID0_12;
    uint32_t UQID0_13;
    uint32_t UQID0_14;
    uint32_t UQID0_15;
    uint32_t UQID0_16;
    uint32_t UQID0_17;
    uint32_t UQID0_18;
    uint32_t UQID0_19;
    uint32_t UQID0_20;
    uint32_t UQID0_21;
    uint32_t UQID0_22;
    uint32_t UQID0_23;
    uint32_t UQID0_24;
    uint32_t UQID0_25;
    uint32_t UQID0_26;
    uint32_t UQID0_27;
    uint32_t UQID0_28;
    uint32_t UQID0_29;
    uint32_t UQID0_30;
    uint32_t UQID0_31;
} stc_efm_uqid0_bit_t;

typedef struct
{
    uint32_t UQID1_0;
    uint32_t UQID1_1;
    uint32_t UQID1_2;
    uint32_t UQID1_3;
    uint32_t UQID1_4;
    uint32_t UQID1_5;
    uint32_t UQID1_6;
    uint32_t UQID1_7;
    uint32_t UQID1_8;
    uint32_t UQID1_9;
    uint32_t UQID1_10;
    uint32_t UQID1_11;
    uint32_t UQID1_12;
    uint32_t UQID1_13;
    uint32_t UQID1_14;
    uint32_t UQID1_15;
    uint32_t UQID1_16;
    uint32_t UQID1_17;
    uint32_t UQID1_18;
    uint32_t UQID1_19;
    uint32_t UQID1_20;
    uint32_t UQID1_21;
    uint32_t UQID1_22;
    uint32_t UQID1_23;
    uint32_t UQID1_24;
    uint32_t UQID1_25;
    uint32_t UQID1_26;
    uint32_t UQID1_27;
    uint32_t UQID1_28;
    uint32_t UQID1_29;
    uint32_t UQID1_30;
    uint32_t UQID1_31;
} stc_efm_uqid1_bit_t;

typedef struct
{
    uint32_t UQID2_0;
    uint32_t UQID2_1;
    uint32_t UQID2_2;
    uint32_t UQID2_3;
    uint32_t UQID2_4;
    uint32_t UQID2_5;
    uint32_t UQID2_6;
    uint32_t UQID2_7;
    uint32_t UQID2_8;
    uint32_t UQID2_9;
    uint32_t UQID2_10;
    uint32_t UQID2_11;
    uint32_t UQID2_12;
    uint32_t UQID2_13;
    uint32_t UQID2_14;
    uint32_t UQID2_15;
    uint32_t UQID2_16;
    uint32_t UQID2_17;
    uint32_t UQID2_18;
    uint32_t UQID2_19;
    uint32_t UQID2_20;
    uint32_t UQID2_21;
    uint32_t UQID2_22;
    uint32_t UQID2_23;
    uint32_t UQID2_24;
    uint32_t UQID2_25;
    uint32_t UQID2_26;
    uint32_t UQID2_27;
    uint32_t UQID2_28;
    uint32_t UQID2_29;
    uint32_t UQID2_30;
    uint32_t UQID2_31;
} stc_efm_uqid2_bit_t;

typedef struct
{
    __IO uint32_t HRCFREQS0;
    __IO uint32_t HRCFREQS1;
    __IO uint32_t HRCFREQS2;
    __IO uint32_t HRCFREQS3;
    uint32_t RESERVED0[4];
} stc_efm_hrccfgr_bit_t;

typedef struct
{
    __IO uint32_t DFS0;
    __IO uint32_t DFS1;
    __IO uint32_t DFDIS;
    uint32_t RESERVED0[5];
    __IO uint32_t LVDLVL0;
    __IO uint32_t LVDLVL1;
    __IO uint32_t LVDLVL2;
    __IO uint32_t LVDLVL3;
    __IO uint32_t NMIS;
    __IO uint32_t IRS;
    __IO uint32_t IRDIS;
    __IO uint32_t LVDDIS;
} stc_efm_lvdicgcr_bit_t;

typedef struct
{
    __IO uint32_t PORTINEN;
    __IO uint32_t CMPEN0;
    __IO uint32_t CMPEN1;
    uint32_t RESERVED0[2];
    __IO uint32_t OSCSTPEN;
    __IO uint32_t PWMSEL0;
    __IO uint32_t PWMSEL1;
    __IO uint32_t PWMSEL2;
    uint32_t RESERVED1[19];
    __IO uint32_t NFSEL0;
    __IO uint32_t NFSEL1;
    __IO uint32_t NFEN;
    __IO uint32_t INVSEL;
} stc_emb_ctl_bit_t;

typedef struct
{
    __IO uint32_t PWMLV0;
    __IO uint32_t PWMLV1;
    __IO uint32_t PWMLV2;
    uint32_t RESERVED0[29];
} stc_emb_pwmlv_bit_t;

typedef struct
{
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe_bit_t;

typedef struct
{
    __IO uint32_t PORTINF;
    __IO uint32_t PWMSF;
    __IO uint32_t CMPF;
    __IO uint32_t OSF;
    __IO uint32_t PORTINST;
    __IO uint32_t PWMST;
    uint32_t RESERVED0[26];
} stc_emb_stat_bit_t;

typedef struct
{
    __IO uint32_t PORTINFCLR;
    __IO uint32_t PWMSFCLR;
    __IO uint32_t CMPFCLR;
    __IO uint32_t OSFCLR;
    uint32_t RESERVED0[28];
} stc_emb_statclr_bit_t;

typedef struct
{
    __IO uint32_t PORTINTEN;
    __IO uint32_t PWMINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED0[28];
} stc_emb_inten_bit_t;

typedef struct
{
    __IO uint32_t PE;
    __IO uint32_t SMBUS;
    __IO uint32_t SMBALRTEN;
    __IO uint32_t SMBDEFAULTEN;
    __IO uint32_t SMBHOSTEN;
    __IO uint32_t FACKEN;
    __IO uint32_t GCEN;
    __IO uint32_t RESTART;
    __IO uint32_t START;
    __IO uint32_t STOP;
    __IO uint32_t ACK;
    uint32_t RESERVED0[4];
    __IO uint32_t SWRST;
    uint32_t RESERVED1[16];
} stc_i2c_cr1_bit_t;

typedef struct
{
    __IO uint32_t STARTIE;
    __IO uint32_t SLADDR0IE;
    __IO uint32_t SLADDR1IE;
    __IO uint32_t TENDIE;
    __IO uint32_t STOPIE;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLIE;
    __IO uint32_t TEMPTYIE;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOIE;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKIE;
    uint32_t RESERVED3[7];
    __IO uint32_t GENCALLIE;
    __IO uint32_t SMBDEFAULTIE;
    __IO uint32_t SMBHOSTIE;
    __IO uint32_t SMBALRTIE;
    uint32_t RESERVED4[8];
} stc_i2c_cr2_bit_t;

typedef struct
{
    __IO uint32_t SLADDR00;
    __IO uint32_t SLADDR01;
    __IO uint32_t SLADDR02;
    __IO uint32_t SLADDR03;
    __IO uint32_t SLADDR04;
    __IO uint32_t SLADDR05;
    __IO uint32_t SLADDR06;
    __IO uint32_t SLADDR07;
    __IO uint32_t SLADDR08;
    __IO uint32_t SLADDR09;
    uint32_t RESERVED0[2];
    __IO uint32_t SLADDR0EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD0;
    uint32_t RESERVED2[16];
} stc_i2c_slr0_bit_t;

typedef struct
{
    __IO uint32_t SLADDR10;
    __IO uint32_t SLADDR11;
    __IO uint32_t SLADDR12;
    __IO uint32_t SLADDR13;
    __IO uint32_t SLADDR14;
    __IO uint32_t SLADDR15;
    __IO uint32_t SLADDR16;
    __IO uint32_t SLADDR17;
    __IO uint32_t SLADDR18;
    __IO uint32_t SLADDR19;
    uint32_t RESERVED0[2];
    __IO uint32_t SLADDR1EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD1;
    uint32_t RESERVED2[16];
} stc_i2c_slr1_bit_t;

typedef struct
{
    __IO uint32_t STARTF;
    __IO uint32_t SLADDR0F;
    __IO uint32_t SLADDR1F;
    __IO uint32_t TENDF;
    __IO uint32_t STOPF;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLF;
    __IO uint32_t TEMPTYF;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOF;
    __IO uint32_t ACKRF;
    uint32_t RESERVED2[1];
    __IO uint32_t NACKF;
    uint32_t RESERVED3[3];
    __IO uint32_t MSL;
    __IO uint32_t BUSY;
    __IO uint32_t TRA;
    uint32_t RESERVED4[1];
    __IO uint32_t GENCALLF;
    __IO uint32_t SMBDEFAULTF;
    __IO uint32_t SMBHOSTF;
    __IO uint32_t SMBALRTF;
    uint32_t RESERVED5[8];
} stc_i2c_sr_bit_t;

typedef struct
{
    __IO uint32_t STARTFCLR;
    __IO uint32_t SLADDR0FCLR;
    __IO uint32_t SLADDR1FCLR;
    __IO uint32_t TENDFCLR;
    __IO uint32_t STOPFCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLFCLR;
    __IO uint32_t TEMPTYFCLR;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOFCLR;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKFCLR;
    uint32_t RESERVED3[7];
    __IO uint32_t GENCALLFCLR;
    __IO uint32_t SMBDEFAULTFCLR;
    __IO uint32_t SMBHOSTFCLR;
    __IO uint32_t SMBALRTFCLR;
    uint32_t RESERVED4[8];
} stc_i2c_clr_bit_t;

typedef struct
{
    __IO uint32_t DT0;
    __IO uint32_t DT1;
    __IO uint32_t DT2;
    __IO uint32_t DT3;
    __IO uint32_t DT4;
    __IO uint32_t DT5;
    __IO uint32_t DT6;
    __IO uint32_t DT7;
} stc_i2c_dtr_bit_t;

typedef struct
{
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t DR4;
    __IO uint32_t DR5;
    __IO uint32_t DR6;
    __IO uint32_t DR7;
} stc_i2c_drr_bit_t;

typedef struct
{
    __IO uint32_t SLOWW0;
    __IO uint32_t SLOWW1;
    __IO uint32_t SLOWW2;
    __IO uint32_t SLOWW3;
    __IO uint32_t SLOWW4;
    uint32_t RESERVED0[3];
    __IO uint32_t SHIGHW0;
    __IO uint32_t SHIGHW1;
    __IO uint32_t SHIGHW2;
    __IO uint32_t SHIGHW3;
    __IO uint32_t SHIGHW4;
    uint32_t RESERVED1[3];
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    uint32_t RESERVED2[13];
} stc_i2c_ccr_bit_t;

typedef struct
{
    __IO uint32_t DNF0;
    __IO uint32_t DNF1;
    uint32_t RESERVED0[2];
    __IO uint32_t DNFEN;
    __IO uint32_t ANFEN;
    uint32_t RESERVED1[26];
} stc_i2c_fltr_bit_t;

typedef struct
{
    __IO uint32_t SWDTAUTS;
    __IO uint32_t SWDTITS;
    __IO uint32_t SWDTPERI0;
    __IO uint32_t SWDTPERI1;
    __IO uint32_t SWDTCKS0;
    __IO uint32_t SWDTCKS1;
    __IO uint32_t SWDTCKS2;
    __IO uint32_t SWDTCKS3;
    __IO uint32_t SWDTWDPT0;
    __IO uint32_t SWDTWDPT1;
    __IO uint32_t SWDTWDPT2;
    __IO uint32_t SWDTWDPT3;
    __IO uint32_t SWDTSLPOFF;
    uint32_t RESERVED0[3];
    __IO uint32_t HRCREQS0;
    __IO uint32_t HRCREQS1;
    __IO uint32_t HRCREQS2;
    __IO uint32_t HRCREQS3;
    uint32_t RESERVED1[6];
    __IO uint32_t NMIFCLK0;
    __IO uint32_t NMIFCLK1;
    __IO uint32_t NMIFEN;
    __IO uint32_t NMITRG;
    __IO uint32_t NMIEN;
    __IO uint32_t NMIICGENA;
} stc_icg_icg0_bit_t;

typedef struct
{
    __IO uint32_t DFS0;
    __IO uint32_t DFS1;
    __IO uint32_t DFDIS;
    uint32_t RESERVED0[5];
    __IO uint32_t LVDLVL0;
    __IO uint32_t LVDLVL1;
    __IO uint32_t LVDLVL2;
    __IO uint32_t LVDLVL3;
    __IO uint32_t NMIS;
    __IO uint32_t IRS;
    __IO uint32_t IRDIS;
    __IO uint32_t LVDDIS;
    uint32_t RESERVED1[16];
} stc_icg_icg1_bit_t;

typedef struct
{
    uint32_t ICG2_0;
    uint32_t ICG2_1;
    uint32_t ICG2_2;
    uint32_t ICG2_3;
    uint32_t ICG2_4;
    uint32_t ICG2_5;
    uint32_t ICG2_6;
    uint32_t ICG2_7;
    uint32_t ICG2_8;
    uint32_t ICG2_9;
    uint32_t ICG2_10;
    uint32_t ICG2_11;
    uint32_t ICG2_12;
    uint32_t ICG2_13;
    uint32_t ICG2_14;
    uint32_t ICG2_15;
    uint32_t ICG2_16;
    uint32_t ICG2_17;
    uint32_t ICG2_18;
    uint32_t ICG2_19;
    uint32_t ICG2_20;
    uint32_t ICG2_21;
    uint32_t ICG2_22;
    uint32_t ICG2_23;
    uint32_t ICG2_24;
    uint32_t ICG2_25;
    uint32_t ICG2_26;
    uint32_t ICG2_27;
    uint32_t ICG2_28;
    uint32_t ICG2_29;
    uint32_t ICG2_30;
    uint32_t ICG2_31;
} stc_icg_icg2_bit_t;

typedef struct
{
    uint32_t ICG3_0;
    uint32_t ICG3_1;
    uint32_t ICG3_2;
    uint32_t ICG3_3;
    uint32_t ICG3_4;
    uint32_t ICG3_5;
    uint32_t ICG3_6;
    uint32_t ICG3_7;
    uint32_t ICG3_8;
    uint32_t ICG3_9;
    uint32_t ICG3_10;
    uint32_t ICG3_11;
    uint32_t ICG3_12;
    uint32_t ICG3_13;
    uint32_t ICG3_14;
    uint32_t ICG3_15;
    uint32_t ICG3_16;
    uint32_t ICG3_17;
    uint32_t ICG3_18;
    uint32_t ICG3_19;
    uint32_t ICG3_20;
    uint32_t ICG3_21;
    uint32_t ICG3_22;
    uint32_t ICG3_23;
    uint32_t ICG3_24;
    uint32_t ICG3_25;
    uint32_t ICG3_26;
    uint32_t ICG3_27;
    uint32_t ICG3_28;
    uint32_t ICG3_29;
    uint32_t ICG3_30;
    uint32_t ICG3_31;
} stc_icg_icg3_bit_t;

typedef struct
{
    uint32_t ICG4_0;
    uint32_t ICG4_1;
    uint32_t ICG4_2;
    uint32_t ICG4_3;
    uint32_t ICG4_4;
    uint32_t ICG4_5;
    uint32_t ICG4_6;
    uint32_t ICG4_7;
    uint32_t ICG4_8;
    uint32_t ICG4_9;
    uint32_t ICG4_10;
    uint32_t ICG4_11;
    uint32_t ICG4_12;
    uint32_t ICG4_13;
    uint32_t ICG4_14;
    uint32_t ICG4_15;
    uint32_t ICG4_16;
    uint32_t ICG4_17;
    uint32_t ICG4_18;
    uint32_t ICG4_19;
    uint32_t ICG4_20;
    uint32_t ICG4_21;
    uint32_t ICG4_22;
    uint32_t ICG4_23;
    uint32_t ICG4_24;
    uint32_t ICG4_25;
    uint32_t ICG4_26;
    uint32_t ICG4_27;
    uint32_t ICG4_28;
    uint32_t ICG4_29;
    uint32_t ICG4_30;
    uint32_t ICG4_31;
} stc_icg_icg4_bit_t;

