SoCXin/HC32M120/src/template/hc32m120f6tb_template/common/hc32m120f6tb.h
typedef struct
{
    __IO uint32_t CMFA;
    __IO uint32_t OVFA;
    uint32_t RESERVED0[30];
} stc_tmr2_stflr_bit_t;

typedef struct
{
    uint32_t OCCRUH_0;
    uint32_t OCCRUH_1;
    uint32_t OCCRUH_2;
    uint32_t OCCRUH_3;
    uint32_t OCCRUH_4;
    uint32_t OCCRUH_5;
    uint32_t OCCRUH_6;
    uint32_t OCCRUH_7;
    uint32_t OCCRUH_8;
    uint32_t OCCRUH_9;
    uint32_t OCCRUH_10;
    uint32_t OCCRUH_11;
    uint32_t OCCRUH_12;
    uint32_t OCCRUH_13;
    uint32_t OCCRUH_14;
    uint32_t OCCRUH_15;
} stc_tmr4_occruh_bit_t;

typedef struct
{
    uint32_t OCCRUL_0;
    uint32_t OCCRUL_1;
    uint32_t OCCRUL_2;
    uint32_t OCCRUL_3;
    uint32_t OCCRUL_4;
    uint32_t OCCRUL_5;
    uint32_t OCCRUL_6;
    uint32_t OCCRUL_7;
    uint32_t OCCRUL_8;
    uint32_t OCCRUL_9;
    uint32_t OCCRUL_10;
    uint32_t OCCRUL_11;
    uint32_t OCCRUL_12;
    uint32_t OCCRUL_13;
    uint32_t OCCRUL_14;
    uint32_t OCCRUL_15;
} stc_tmr4_occrul_bit_t;

typedef struct
{
    uint32_t OCCRVH_0;
    uint32_t OCCRVH_1;
    uint32_t OCCRVH_2;
    uint32_t OCCRVH_3;
    uint32_t OCCRVH_4;
    uint32_t OCCRVH_5;
    uint32_t OCCRVH_6;
    uint32_t OCCRVH_7;
    uint32_t OCCRVH_8;
    uint32_t OCCRVH_9;
    uint32_t OCCRVH_10;
    uint32_t OCCRVH_11;
    uint32_t OCCRVH_12;
    uint32_t OCCRVH_13;
    uint32_t OCCRVH_14;
    uint32_t OCCRVH_15;
} stc_tmr4_occrvh_bit_t;

typedef struct
{
    uint32_t OCCRVL_0;
    uint32_t OCCRVL_1;
    uint32_t OCCRVL_2;
    uint32_t OCCRVL_3;
    uint32_t OCCRVL_4;
    uint32_t OCCRVL_5;
    uint32_t OCCRVL_6;
    uint32_t OCCRVL_7;
    uint32_t OCCRVL_8;
    uint32_t OCCRVL_9;
    uint32_t OCCRVL_10;
    uint32_t OCCRVL_11;
    uint32_t OCCRVL_12;
    uint32_t OCCRVL_13;
    uint32_t OCCRVL_14;
    uint32_t OCCRVL_15;
} stc_tmr4_occrvl_bit_t;

typedef struct
{
    uint32_t OCCRWH_0;
    uint32_t OCCRWH_1;
    uint32_t OCCRWH_2;
    uint32_t OCCRWH_3;
    uint32_t OCCRWH_4;
    uint32_t OCCRWH_5;
    uint32_t OCCRWH_6;
    uint32_t OCCRWH_7;
    uint32_t OCCRWH_8;
    uint32_t OCCRWH_9;
    uint32_t OCCRWH_10;
    uint32_t OCCRWH_11;
    uint32_t OCCRWH_12;
    uint32_t OCCRWH_13;
    uint32_t OCCRWH_14;
    uint32_t OCCRWH_15;
} stc_tmr4_occrwh_bit_t;

typedef struct
{
    uint32_t OCCRWL_0;
    uint32_t OCCRWL_1;
    uint32_t OCCRWL_2;
    uint32_t OCCRWL_3;
    uint32_t OCCRWL_4;
    uint32_t OCCRWL_5;
    uint32_t OCCRWL_6;
    uint32_t OCCRWL_7;
    uint32_t OCCRWL_8;
    uint32_t OCCRWL_9;
    uint32_t OCCRWL_10;
    uint32_t OCCRWL_11;
    uint32_t OCCRWL_12;
    uint32_t OCCRWL_13;
    uint32_t OCCRWL_14;
    uint32_t OCCRWL_15;
} stc_tmr4_occrwl_bit_t;

typedef struct
{
    __IO uint32_t OCEH;
    __IO uint32_t OCEL;
    __IO uint32_t OCPH;
    __IO uint32_t OCPL;
    __IO uint32_t OCIEH;
    __IO uint32_t OCIEL;
    __IO uint32_t OCFH;
    __IO uint32_t OCFL;
    uint32_t RESERVED0[8];
} stc_tmr4_ocsr_bit_t;

typedef struct
{
    __IO uint32_t CHBUFEN0;
    __IO uint32_t CHBUFEN1;
    __IO uint32_t CLBUFEN0;
    __IO uint32_t CLBUFEN1;
    __IO uint32_t MHBUFEN0;
    __IO uint32_t MHBUFEN1;
    __IO uint32_t MLBUFEN0;
    __IO uint32_t MLBUFEN1;
    __IO uint32_t LMCH;
    __IO uint32_t LMCL;
    __IO uint32_t LMMH;
    __IO uint32_t LMML;
    __IO uint32_t MCECH;
    __IO uint32_t MCECL;
    uint32_t RESERVED0[2];
} stc_tmr4_ocer_bit_t;

typedef struct
{
    __IO uint32_t OCFDCH;
    __IO uint32_t OCFPKH;
    __IO uint32_t OCFUCH;
    __IO uint32_t OCFZRH;
    __IO uint32_t OPDCH0;
    __IO uint32_t OPDCH1;
    __IO uint32_t OPPKH0;
    __IO uint32_t OPPKH1;
    __IO uint32_t OPUCH0;
    __IO uint32_t OPUCH1;
    __IO uint32_t OPZRH0;
    __IO uint32_t OPZRH1;
    __IO uint32_t OPNPKH0;
    __IO uint32_t OPNPKH1;
    __IO uint32_t OPNZRH0;
    __IO uint32_t OPNZRH1;
} stc_tmr4_ocmrh_bit_t;

typedef struct
{
    __IO uint32_t OCFDCL;
    __IO uint32_t OCFPKL;
    __IO uint32_t OCFUCL;
    __IO uint32_t OCFZRL;
    __IO uint32_t OPDCL0;
    __IO uint32_t OPDCL1;
    __IO uint32_t OPPKL0;
    __IO uint32_t OPPKL1;
    __IO uint32_t OPUCL0;
    __IO uint32_t OPUCL1;
    __IO uint32_t OPZRL0;
    __IO uint32_t OPZRL1;
    __IO uint32_t OPNPKL0;
    __IO uint32_t OPNPKL1;
    __IO uint32_t OPNZRL0;
    __IO uint32_t OPNZRL1;
    __IO uint32_t EOPNDCL0;
    __IO uint32_t EOPNDCL1;
    __IO uint32_t EOPNUCL0;
    __IO uint32_t EOPNUCL1;
    __IO uint32_t EOPDCL0;
    __IO uint32_t EOPDCL1;
    __IO uint32_t EOPPKL0;
    __IO uint32_t EOPPKL1;
    __IO uint32_t EOPUCL0;
    __IO uint32_t EOPUCL1;
    __IO uint32_t EOPZRL0;
    __IO uint32_t EOPZRL1;
    __IO uint32_t EOPNPKL0;
    __IO uint32_t EOPNPKL1;
    __IO uint32_t EOPNZRL0;
    __IO uint32_t EOPNZRL1;
} stc_tmr4_ocmrl_bit_t;

typedef struct
{
    uint32_t CPSR_0;
    uint32_t CPSR_1;
    uint32_t CPSR_2;
    uint32_t CPSR_3;
    uint32_t CPSR_4;
    uint32_t CPSR_5;
    uint32_t CPSR_6;
    uint32_t CPSR_7;
    uint32_t CPSR_8;
    uint32_t CPSR_9;
    uint32_t CPSR_10;
    uint32_t CPSR_11;
    uint32_t CPSR_12;
    uint32_t CPSR_13;
    uint32_t CPSR_14;
    uint32_t CPSR_15;
} stc_tmr4_cpsr_bit_t;

typedef struct
{
    uint32_t CNTR_0;
    uint32_t CNTR_1;
    uint32_t CNTR_2;
    uint32_t CNTR_3;
    uint32_t CNTR_4;
    uint32_t CNTR_5;
    uint32_t CNTR_6;
    uint32_t CNTR_7;
    uint32_t CNTR_8;
    uint32_t CNTR_9;
    uint32_t CNTR_10;
    uint32_t CNTR_11;
    uint32_t CNTR_12;
    uint32_t CNTR_13;
    uint32_t CNTR_14;
    uint32_t CNTR_15;
} stc_tmr4_cntr_bit_t;

typedef struct
{
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t CLEAR;
    __IO uint32_t MODE;
    __IO uint32_t STOP;
    __IO uint32_t BUFEN;
    __IO uint32_t IRQPEN;
    __IO uint32_t IRQPF;
    uint32_t RESERVED0[3];
    __IO uint32_t IRQZEN;
    __IO uint32_t IRQZF;
    __IO uint32_t ECKEN;
} stc_tmr4_ccsr_bit_t;

typedef struct
{
    __IO uint32_t ZIM0;
    __IO uint32_t ZIM1;
    __IO uint32_t ZIM2;
    __IO uint32_t ZIM3;
    __IO uint32_t PIM0;
    __IO uint32_t PIM1;
    __IO uint32_t PIM2;
    __IO uint32_t PIM3;
    __IO uint32_t ZIC0;
    __IO uint32_t ZIC1;
    __IO uint32_t ZIC2;
    __IO uint32_t ZIC3;
    __IO uint32_t PIC0;
    __IO uint32_t PIC1;
    __IO uint32_t PIC2;
    __IO uint32_t PIC3;
} stc_tmr4_cvpr_bit_t;

typedef struct
{
    uint32_t PFSRU_0;
    uint32_t PFSRU_1;
    uint32_t PFSRU_2;
    uint32_t PFSRU_3;
    uint32_t PFSRU_4;
    uint32_t PFSRU_5;
    uint32_t PFSRU_6;
    uint32_t PFSRU_7;
    uint32_t PFSRU_8;
    uint32_t PFSRU_9;
    uint32_t PFSRU_10;
    uint32_t PFSRU_11;
    uint32_t PFSRU_12;
    uint32_t PFSRU_13;
    uint32_t PFSRU_14;
    uint32_t PFSRU_15;
} stc_tmr4_pfsru_bit_t;

typedef struct
{
    uint32_t PDARU_0;
    uint32_t PDARU_1;
    uint32_t PDARU_2;
    uint32_t PDARU_3;
    uint32_t PDARU_4;
    uint32_t PDARU_5;
    uint32_t PDARU_6;
    uint32_t PDARU_7;
    uint32_t PDARU_8;
    uint32_t PDARU_9;
    uint32_t PDARU_10;
    uint32_t PDARU_11;
    uint32_t PDARU_12;
    uint32_t PDARU_13;
    uint32_t PDARU_14;
    uint32_t PDARU_15;
} stc_tmr4_pdaru_bit_t;

typedef struct
{
    uint32_t PDBRU_0;
    uint32_t PDBRU_1;
    uint32_t PDBRU_2;
    uint32_t PDBRU_3;
    uint32_t PDBRU_4;
    uint32_t PDBRU_5;
    uint32_t PDBRU_6;
    uint32_t PDBRU_7;
    uint32_t PDBRU_8;
    uint32_t PDBRU_9;
    uint32_t PDBRU_10;
    uint32_t PDBRU_11;
    uint32_t PDBRU_12;
    uint32_t PDBRU_13;
    uint32_t PDBRU_14;
    uint32_t PDBRU_15;
} stc_tmr4_pdbru_bit_t;

typedef struct
{
    uint32_t PFSRV_0;
    uint32_t PFSRV_1;
    uint32_t PFSRV_2;
    uint32_t PFSRV_3;
    uint32_t PFSRV_4;
    uint32_t PFSRV_5;
    uint32_t PFSRV_6;
    uint32_t PFSRV_7;
    uint32_t PFSRV_8;
    uint32_t PFSRV_9;
    uint32_t PFSRV_10;
    uint32_t PFSRV_11;
    uint32_t PFSRV_12;
    uint32_t PFSRV_13;
    uint32_t PFSRV_14;
    uint32_t PFSRV_15;
} stc_tmr4_pfsrv_bit_t;

typedef struct
{
    uint32_t PDARV_0;
    uint32_t PDARV_1;
    uint32_t PDARV_2;
    uint32_t PDARV_3;
    uint32_t PDARV_4;
    uint32_t PDARV_5;
    uint32_t PDARV_6;
    uint32_t PDARV_7;
    uint32_t PDARV_8;
    uint32_t PDARV_9;
    uint32_t PDARV_10;
    uint32_t PDARV_11;
    uint32_t PDARV_12;
    uint32_t PDARV_13;
    uint32_t PDARV_14;
    uint32_t PDARV_15;
} stc_tmr4_pdarv_bit_t;

typedef struct
{
    uint32_t PDBRV_0;
    uint32_t PDBRV_1;
    uint32_t PDBRV_2;
    uint32_t PDBRV_3;
    uint32_t PDBRV_4;
    uint32_t PDBRV_5;
    uint32_t PDBRV_6;
    uint32_t PDBRV_7;
    uint32_t PDBRV_8;
    uint32_t PDBRV_9;
    uint32_t PDBRV_10;
    uint32_t PDBRV_11;
    uint32_t PDBRV_12;
    uint32_t PDBRV_13;
    uint32_t PDBRV_14;
    uint32_t PDBRV_15;
} stc_tmr4_pdbrv_bit_t;

typedef struct
{
    uint32_t PFSRW_0;
    uint32_t PFSRW_1;
    uint32_t PFSRW_2;
    uint32_t PFSRW_3;
    uint32_t PFSRW_4;
    uint32_t PFSRW_5;
    uint32_t PFSRW_6;
    uint32_t PFSRW_7;
    uint32_t PFSRW_8;
    uint32_t PFSRW_9;
    uint32_t PFSRW_10;
    uint32_t PFSRW_11;
    uint32_t PFSRW_12;
    uint32_t PFSRW_13;
    uint32_t PFSRW_14;
    uint32_t PFSRW_15;
} stc_tmr4_pfsrw_bit_t;

typedef struct
{
    uint32_t PDARW_0;
    uint32_t PDARW_1;
    uint32_t PDARW_2;
    uint32_t PDARW_3;
    uint32_t PDARW_4;
    uint32_t PDARW_5;
    uint32_t PDARW_6;
    uint32_t PDARW_7;
    uint32_t PDARW_8;
    uint32_t PDARW_9;
    uint32_t PDARW_10;
    uint32_t PDARW_11;
    uint32_t PDARW_12;
    uint32_t PDARW_13;
    uint32_t PDARW_14;
    uint32_t PDARW_15;
} stc_tmr4_pdarw_bit_t;

typedef struct
{
    uint32_t PDBRW_0;
    uint32_t PDBRW_1;
    uint32_t PDBRW_2;
    uint32_t PDBRW_3;
    uint32_t PDBRW_4;
    uint32_t PDBRW_5;
    uint32_t PDBRW_6;
    uint32_t PDBRW_7;
    uint32_t PDBRW_8;
    uint32_t PDBRW_9;
    uint32_t PDBRW_10;
    uint32_t PDBRW_11;
    uint32_t PDBRW_12;
    uint32_t PDBRW_13;
    uint32_t PDBRW_14;
    uint32_t PDBRW_15;
} stc_tmr4_pdbrw_bit_t;

typedef struct
{
    __IO uint32_t DIVCK0;
    __IO uint32_t DIVCK1;
    __IO uint32_t DIVCK2;
    uint32_t RESERVED0[1];
    __IO uint32_t PWMMD0;
    __IO uint32_t PWMMD1;
    __IO uint32_t LVLS0;
    __IO uint32_t LVLS1;
    uint32_t RESERVED1[8];
} stc_tmr4_pocr_bit_t;

typedef struct
{
    __IO uint32_t RTIDU;
    __IO uint32_t RTIDV;
    __IO uint32_t RTIDW;
    uint32_t RESERVED0[1];
    __IO uint32_t RTIFU;
    __IO uint32_t RTICU;
    __IO uint32_t RTEU;
    __IO uint32_t RTSU;
    __IO uint32_t RTIFV;
    __IO uint32_t RTICV;
    __IO uint32_t RTEV;
    __IO uint32_t RTSV;
    __IO uint32_t RTIFW;
    __IO uint32_t RTICW;
    __IO uint32_t RTEW;
    __IO uint32_t RTSW;
} stc_tmr4_rcsr_bit_t;

typedef struct
{
    uint32_t SCCRUH_0;
    uint32_t SCCRUH_1;
    uint32_t SCCRUH_2;
    uint32_t SCCRUH_3;
    uint32_t SCCRUH_4;
    uint32_t SCCRUH_5;
    uint32_t SCCRUH_6;
    uint32_t SCCRUH_7;
    uint32_t SCCRUH_8;
    uint32_t SCCRUH_9;
    uint32_t SCCRUH_10;
    uint32_t SCCRUH_11;
    uint32_t SCCRUH_12;
    uint32_t SCCRUH_13;
    uint32_t SCCRUH_14;
    uint32_t SCCRUH_15;
} stc_tmr4_sccruh_bit_t;

typedef struct
{
    uint32_t SCCRUL_0;
    uint32_t SCCRUL_1;
    uint32_t SCCRUL_2;
    uint32_t SCCRUL_3;
    uint32_t SCCRUL_4;
    uint32_t SCCRUL_5;
    uint32_t SCCRUL_6;
    uint32_t SCCRUL_7;
    uint32_t SCCRUL_8;
    uint32_t SCCRUL_9;
    uint32_t SCCRUL_10;
    uint32_t SCCRUL_11;
    uint32_t SCCRUL_12;
    uint32_t SCCRUL_13;
    uint32_t SCCRUL_14;
    uint32_t SCCRUL_15;
} stc_tmr4_sccrul_bit_t;

typedef struct
{
    uint32_t SCCRVH_0;
    uint32_t SCCRVH_1;
    uint32_t SCCRVH_2;
    uint32_t SCCRVH_3;
    uint32_t SCCRVH_4;
    uint32_t SCCRVH_5;
    uint32_t SCCRVH_6;
    uint32_t SCCRVH_7;
    uint32_t SCCRVH_8;
    uint32_t SCCRVH_9;
    uint32_t SCCRVH_10;
    uint32_t SCCRVH_11;
    uint32_t SCCRVH_12;
    uint32_t SCCRVH_13;
    uint32_t SCCRVH_14;
    uint32_t SCCRVH_15;
} stc_tmr4_sccrvh_bit_t;

typedef struct
{
    uint32_t SCCRVL_0;
    uint32_t SCCRVL_1;
    uint32_t SCCRVL_2;
    uint32_t SCCRVL_3;
    uint32_t SCCRVL_4;
    uint32_t SCCRVL_5;
    uint32_t SCCRVL_6;
    uint32_t SCCRVL_7;
    uint32_t SCCRVL_8;
    uint32_t SCCRVL_9;
    uint32_t SCCRVL_10;
    uint32_t SCCRVL_11;
    uint32_t SCCRVL_12;
    uint32_t SCCRVL_13;
    uint32_t SCCRVL_14;
    uint32_t SCCRVL_15;
} stc_tmr4_sccrvl_bit_t;

typedef struct
{
    uint32_t SCCRWH_0;
    uint32_t SCCRWH_1;
    uint32_t SCCRWH_2;
    uint32_t SCCRWH_3;
    uint32_t SCCRWH_4;
    uint32_t SCCRWH_5;
    uint32_t SCCRWH_6;
    uint32_t SCCRWH_7;
    uint32_t SCCRWH_8;
    uint32_t SCCRWH_9;
    uint32_t SCCRWH_10;
    uint32_t SCCRWH_11;
    uint32_t SCCRWH_12;
    uint32_t SCCRWH_13;
    uint32_t SCCRWH_14;
    uint32_t SCCRWH_15;
} stc_tmr4_sccrwh_bit_t;

typedef struct
{
    uint32_t SCCRWL_0;
    uint32_t SCCRWL_1;
    uint32_t SCCRWL_2;
    uint32_t SCCRWL_3;
    uint32_t SCCRWL_4;
    uint32_t SCCRWL_5;
    uint32_t SCCRWL_6;
    uint32_t SCCRWL_7;
    uint32_t SCCRWL_8;
    uint32_t SCCRWL_9;
    uint32_t SCCRWL_10;
    uint32_t SCCRWL_11;
    uint32_t SCCRWL_12;
    uint32_t SCCRWL_13;
    uint32_t SCCRWL_14;
    uint32_t SCCRWL_15;
} stc_tmr4_sccrwl_bit_t;

typedef struct
{
    __IO uint32_t BUFEN0;
    __IO uint32_t BUFEN1;
    __IO uint32_t EVTOS0;
    __IO uint32_t EVTOS1;
    __IO uint32_t EVTOS2;
    __IO uint32_t LMC;
    uint32_t RESERVED0[2];
    __IO uint32_t EVTMS;
    __IO uint32_t EVTDS;
    uint32_t RESERVED1[2];
    __IO uint32_t DEN;
    __IO uint32_t PEN;
    __IO uint32_t UEN;
    __IO uint32_t ZEN;
} stc_tmr4_scsr_bit_t;

typedef struct
{
    __IO uint32_t AMC0;
    __IO uint32_t AMC1;
    __IO uint32_t AMC2;
    __IO uint32_t AMC3;
    uint32_t RESERVED0[2];
    __IO uint32_t MZCE;
    __IO uint32_t MPCE;
    uint32_t RESERVED1[8];
} stc_tmr4_scmr_bit_t;

typedef struct
{
    __IO uint32_t EMBVAL0;
    __IO uint32_t EMBVAL1;
    __IO uint32_t EMBVAL2;
    uint32_t RESERVED0[29];
} stc_tmr4_ecsr_bit_t;

typedef struct
{
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t CNT10;
    __IO uint32_t CNT11;
    __IO uint32_t CNT12;
    __IO uint32_t CNT13;
    __IO uint32_t CNT14;
    __IO uint32_t CNT15;
} stc_tmra_cnter_bit_t;

typedef struct
{
    __IO uint32_t PER0;
    __IO uint32_t PER1;
    __IO uint32_t PER2;
    __IO uint32_t PER3;
    __IO uint32_t PER4;
    __IO uint32_t PER5;
    __IO uint32_t PER6;
    __IO uint32_t PER7;
    __IO uint32_t PER8;
    __IO uint32_t PER9;
    __IO uint32_t PER10;
    __IO uint32_t PER11;
    __IO uint32_t PER12;
    __IO uint32_t PER13;
    __IO uint32_t PER14;
    __IO uint32_t PER15;
} stc_tmra_perar_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
} stc_tmra_cmpar1_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
} stc_tmra_cmpar2_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t DIR;
    __IO uint32_t MODE;
    uint32_t RESERVED0[1];
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t OVSTP;
    uint32_t RESERVED1[3];
    __IO uint32_t INENOVF;
    __IO uint32_t INENUDF;
    __IO uint32_t OVFF;
    __IO uint32_t UDFF;
} stc_tmra_bcstr_bit_t;

typedef struct
{
    __IO uint32_t HSTA0;
    __IO uint32_t HSTA1;
    __IO uint32_t HSTA2;
    uint32_t RESERVED0[1];
    __IO uint32_t HSTP0;
    __IO uint32_t HSTP1;
    __IO uint32_t HSTP2;
    uint32_t RESERVED1[1];
    __IO uint32_t HCLE0;
    __IO uint32_t HCLE1;
    __IO uint32_t HCLE2;
    uint32_t RESERVED2[5];
} stc_tmra_hconr_bit_t;

typedef struct
{
    __IO uint32_t HCUP0;
    __IO uint32_t HCUP1;
    __IO uint32_t HCUP2;
    __IO uint32_t HCUP3;
    __IO uint32_t HCUP4;
    __IO uint32_t HCUP5;
    __IO uint32_t HCUP6;
    __IO uint32_t HCUP7;
    __IO uint32_t HCUP8;
    __IO uint32_t HCUP9;
    __IO uint32_t HCUP10;
    uint32_t RESERVED0[5];
} stc_tmra_hcupr_bit_t;

typedef struct
{
    __IO uint32_t HCDO0;
    __IO uint32_t HCDO1;
    __IO uint32_t HCDO2;
    __IO uint32_t HCDO3;
    __IO uint32_t HCDO4;
    __IO uint32_t HCDO5;
    __IO uint32_t HCDO6;
    __IO uint32_t HCDO7;
    __IO uint32_t HCDO8;
    __IO uint32_t HCDO9;
    __IO uint32_t HCDO10;
    uint32_t RESERVED0[5];
} stc_tmra_hcdor_bit_t;

typedef struct
{
    __IO uint32_t ITEN1;
    __IO uint32_t ITEN2;
    uint32_t RESERVED0[14];
} stc_tmra_iconr_bit_t;

typedef struct
{
    __IO uint32_t ETEN1;
    __IO uint32_t ETEN2;
    uint32_t RESERVED0[14];
} stc_tmra_econr_bit_t;

typedef struct
{
    __IO uint32_t NOFIENTG;
    __IO uint32_t NOFICKTG0;
    __IO uint32_t NOFICKTG1;
    uint32_t RESERVED0[5];
    __IO uint32_t NOFIENCA;
    __IO uint32_t NOFICKCA0;
    __IO uint32_t NOFICKCA1;
    uint32_t RESERVED1[1];
    __IO uint32_t NOFIENCB;
    __IO uint32_t NOFICKCB0;
    __IO uint32_t NOFICKCB1;
    uint32_t RESERVED2[1];
} stc_tmra_fconr_bit_t;

typedef struct
{
    __IO uint32_t CMPF1;
    __IO uint32_t CMPF2;
    uint32_t RESERVED0[14];
} stc_tmra_stflr_bit_t;

typedef struct
{
    __IO uint32_t BEN;
    __IO uint32_t BSE0;
    __IO uint32_t BSE1;
    uint32_t RESERVED0[13];
} stc_tmra_bconr_bit_t;

typedef struct
{
    __IO uint32_t CAPMD;
    uint32_t RESERVED0[3];
    __IO uint32_t HICP0;
    __IO uint32_t HICP1;
    __IO uint32_t HICP2;
    uint32_t RESERVED1[5];
    __IO uint32_t NOFIENCP;
    __IO uint32_t NOFICKCP0;
    __IO uint32_t NOFICKCP1;
    uint32_t RESERVED2[1];
} stc_tmra_cconr1_bit_t;

typedef struct
{
    __IO uint32_t CAPMD;
    uint32_t RESERVED0[3];
    __IO uint32_t HICP0;
    __IO uint32_t HICP1;
    __IO uint32_t HICP2;
    uint32_t RESERVED1[5];
    __IO uint32_t NOFIENCP;
    __IO uint32_t NOFICKCP0;
    __IO uint32_t NOFICKCP1;
    uint32_t RESERVED2[1];
} stc_tmra_cconr2_bit_t;

typedef struct
{
    __IO uint32_t STAC0;
    __IO uint32_t STAC1;
    __IO uint32_t STPC0;
    __IO uint32_t STPC1;
    __IO uint32_t CMPC0;
    __IO uint32_t CMPC1;
    __IO uint32_t PERC0;
    __IO uint32_t PERC1;
    __IO uint32_t FORC0;
    __IO uint32_t FORC1;
    uint32_t RESERVED0[2];
    __IO uint32_t OUTEN;
    uint32_t RESERVED1[3];
} stc_tmra_pconr1_bit_t;

typedef struct
{
    __IO uint32_t STAC0;
    __IO uint32_t STAC1;
    __IO uint32_t STPC0;
    __IO uint32_t STPC1;
    __IO uint32_t CMPC0;
    __IO uint32_t CMPC1;
    __IO uint32_t PERC0;
    __IO uint32_t PERC1;
    __IO uint32_t FORC0;
    __IO uint32_t FORC1;
    uint32_t RESERVED0[2];
    __IO uint32_t OUTEN;
    uint32_t RESERVED1[3];
} stc_tmra_pconr2_bit_t;

typedef struct
{
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t CNT10;
    __IO uint32_t CNT11;
    __IO uint32_t CNT12;
    __IO uint32_t CNT13;
    __IO uint32_t CNT14;
    __IO uint32_t CNT15;
} stc_tmrb_cnter_bit_t;

typedef struct
{
    __IO uint32_t PER0;
    __IO uint32_t PER1;
    __IO uint32_t PER2;
    __IO uint32_t PER3;
    __IO uint32_t PER4;
    __IO uint32_t PER5;
    __IO uint32_t PER6;
    __IO uint32_t PER7;
    __IO uint32_t PER8;
    __IO uint32_t PER9;
    __IO uint32_t PER10;
    __IO uint32_t PER11;
    __IO uint32_t PER12;
    __IO uint32_t PER13;
    __IO uint32_t PER14;
    __IO uint32_t PER15;
} stc_tmrb_perar_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
} stc_tmrb_cmpar_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t DIR;
    __IO uint32_t MODE;
    __IO uint32_t SYNST;
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t OVSTP;
    uint32_t RESERVED0[3];
    __IO uint32_t INENOVF;
    __IO uint32_t INENUDF;
    __IO uint32_t OVFF;
    __IO uint32_t UDFF;
} stc_tmrb_bcstr_bit_t;

typedef struct
{
    __IO uint32_t HSTA0;
    __IO uint32_t HSTA1;
    __IO uint32_t HSTA2;
    uint32_t RESERVED0[1];
    __IO uint32_t HSTP0;
    __IO uint32_t HSTP1;
    __IO uint32_t HSTP2;
    uint32_t RESERVED1[1];
    __IO uint32_t HCLE0;
    __IO uint32_t HCLE1;
    __IO uint32_t HCLE2;
    uint32_t RESERVED2[1];
    __IO uint32_t HCLE3;
    __IO uint32_t HCLE4;
    uint32_t RESERVED3[2];
} stc_tmrb_hconr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t HCUP8;
    __IO uint32_t HCUP9;
    __IO uint32_t HCUP10;
    __IO uint32_t HCUP11;
    __IO uint32_t HCUP12;
    uint32_t RESERVED1[3];
} stc_tmrb_hcupr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t HCDO8;
    __IO uint32_t HCDO9;
    __IO uint32_t HCDO10;
    __IO uint32_t HCDO11;
    __IO uint32_t HCDO12;
    uint32_t RESERVED1[3];
} stc_tmrb_hcdor_bit_t;

typedef struct
{
    __IO uint32_t ITEN1;
    uint32_t RESERVED0[15];
} stc_tmrb_iconr_bit_t;

typedef struct
{
    __IO uint32_t ETEN1;
    uint32_t RESERVED0[31];
} stc_tmrb_econr_bit_t;

typedef struct
{
    __IO uint32_t CMPF1;
    uint32_t RESERVED0[15];
} stc_tmrb_stflr_bit_t;

typedef struct
{
    __IO uint32_t CAPMDA;
    uint32_t RESERVED0[3];
    __IO uint32_t HICP0;
    __IO uint32_t HICP1;
    __IO uint32_t HICP2;
    uint32_t RESERVED1[5];
    __IO uint32_t NOFIENCP;
    __IO uint32_t NOFICKCP0;
    __IO uint32_t NOFICKCP1;
    uint32_t RESERVED2[1];
} stc_tmrb_cconr_bit_t;

typedef struct
{
    __IO uint32_t STAC0;
    __IO uint32_t STAC1;
    __IO uint32_t STPC0;
    __IO uint32_t STPC1;
    __IO uint32_t CMPC0;
    __IO uint32_t CMPC1;
    __IO uint32_t PERC0;
    __IO uint32_t PERC1;
    __IO uint32_t FORC0;
    __IO uint32_t FORC1;
    uint32_t RESERVED0[2];
    __IO uint32_t OUTEN;
    uint32_t RESERVED1[3];
} stc_tmrb_pconr_bit_t;

typedef struct
{
    __IO uint32_t PE;
    __IO uint32_t FE;
    uint32_t RESERVED0[1];
    __IO uint32_t ORE;
    uint32_t RESERVED1[1];
    __IO uint32_t RXNE;
    __IO uint32_t TC;
    __IO uint32_t TXE;
    uint32_t RESERVED2[8];
    __IO uint32_t MPB;
    uint32_t RESERVED3[15];
} stc_usart_sr_bit_t;

typedef struct
{
    __IO uint32_t TDR0;
    __IO uint32_t TDR1;
    __IO uint32_t TDR2;
    __IO uint32_t TDR3;
    __IO uint32_t TDR4;
    __IO uint32_t TDR5;
    __IO uint32_t TDR6;
    __IO uint32_t TDR7;
    __IO uint32_t TDR8;
    __IO uint32_t MPID;
    uint32_t RESERVED0[6];
    __IO uint32_t RDR0;
    __IO uint32_t RDR1;
    __IO uint32_t RDR2;
    __IO uint32_t RDR3;
    __IO uint32_t RDR4;
    __IO uint32_t RDR5;
    __IO uint32_t RDR6;
    __IO uint32_t RDR7;
    __IO uint32_t RDR8;
    uint32_t RESERVED1[7];
} stc_usart_dr_bit_t;

